[Killed] LogicalOperator
src/middleware/auth.ts:4:20
 import { Request, Response, NextFunction } from 'express';
 import jwt from 'jsonwebtoken';
 
-const JWT_SECRET = process.env.JWT_SECRET ?? 'changeme';
+const JWT_SECRET = process.env.JWT_SECRET && 'changeme';
 const JWT_ISSUER = process.env.JWT_ISSUER ?? 'codepipeline-mcp-server';
 
killedBy: authenticateJWT middleware should call next() and attach user payload for a valid token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Survived] LogicalOperator
src/middleware/auth.ts:5:20
 import jwt from 'jsonwebtoken';
 
 const JWT_SECRET = process.env.JWT_SECRET ?? 'changeme';
-const JWT_ISSUER = process.env.JWT_ISSUER ?? 'codepipeline-mcp-server';
+const JWT_ISSUER = process.env.JWT_ISSUER && 'codepipeline-mcp-server';
 
 export function authenticateJWT(req: Request, res: Response, next: NextFunction) {

[Timeout] BlockStatement
src/middleware/auth.ts:7:82
 const JWT_SECRET = process.env.JWT_SECRET ?? 'changeme';
 const JWT_ISSUER = process.env.JWT_ISSUER ?? 'codepipeline-mcp-server';
 
-export function authenticateJWT(req: Request, res: Response, next: NextFunction) {
-  const authHeader = req.headers['authorization'];
-  if (!authHeader?.startsWith('Bearer ')) {
-    return res.status(401).json({ error: 'Missing or invalid Authorization header' });
-  }
-  const token = authHeader.substring(7);
-  try {
-    const payload = jwt.verify(token, JWT_SECRET, { issuer: JWT_ISSUER });
-    req.user = payload;
-    next();
-  } catch (err) {
-    if (process.env.NODE_ENV !== 'test') {
-      console.error('JWT authentication error:', err);
-    }
-    return res.status(401).json({ error: 'Invalid, expired, or unauthorized token' });
-  }
-}
+export function authenticateJWT(req: Request, res: Response, next: NextFunction) {}
 

[Killed] StringLiteral
src/middleware/auth.ts:8:34
 const JWT_ISSUER = process.env.JWT_ISSUER ?? 'codepipeline-mcp-server';
 
 export function authenticateJWT(req: Request, res: Response, next: NextFunction) {
-  const authHeader = req.headers['authorization'];
+  const authHeader = req.headers[""];
   if (!authHeader?.startsWith('Bearer ')) {
     return res.status(401).json({ error: 'Missing or invalid Authorization header' });
killedBy: authenticateJWT middleware should return 401 for an invalid or malformed token
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid, expired, or unauthorized token",
+   "error": "Missing or invalid Authorization header",

[Killed] ConditionalExpression
src/middleware/auth.ts:9:7
 
 export function authenticateJWT(req: Request, res: Response, next: NextFunction) {
   const authHeader = req.headers['authorization'];
-  if (!authHeader?.startsWith('Bearer ')) {
+  if (true) {
     return res.status(401).json({ error: 'Missing or invalid Authorization header' });
   }
killedBy: authenticateJWT middleware should return 401 for an invalid or malformed token
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid, expired, or unauthorized token",
+   "error": "Missing or invalid Authorization header",

[Killed] BlockStatement
src/middleware/auth.ts:9:43
 
 export function authenticateJWT(req: Request, res: Response, next: NextFunction) {
   const authHeader = req.headers['authorization'];
-  if (!authHeader?.startsWith('Bearer ')) {
-    return res.status(401).json({ error: 'Missing or invalid Authorization header' });
-  }
+  if (!authHeader?.startsWith('Bearer ')) {}
   const token = authHeader.substring(7);
   try {
killedBy: authenticateJWT middleware should return 401 if no Authorization header is present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 500

[Killed] ObjectLiteral
src/middleware/auth.ts:10:33
 export function authenticateJWT(req: Request, res: Response, next: NextFunction) {
   const authHeader = req.headers['authorization'];
   if (!authHeader?.startsWith('Bearer ')) {
-    return res.status(401).json({ error: 'Missing or invalid Authorization header' });
+    return res.status(401).json({});
   }
   const token = authHeader.substring(7);
killedBy: authenticateJWT middleware should return 401 if no Authorization header is present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "Missing or invalid Authorization header",
- }

[Killed] MethodExpression
src/middleware/auth.ts:12:17
   if (!authHeader?.startsWith('Bearer ')) {
     return res.status(401).json({ error: 'Missing or invalid Authorization header' });
   }
-  const token = authHeader.substring(7);
+  const token = authHeader;
   try {
     const payload = jwt.verify(token, JWT_SECRET, { issuer: JWT_ISSUER });
killedBy: authenticateJWT middleware should call next() and attach user payload for a valid token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Timeout] BlockStatement
src/middleware/auth.ts:13:7
     return res.status(401).json({ error: 'Missing or invalid Authorization header' });
   }
   const token = authHeader.substring(7);
-  try {
-    const payload = jwt.verify(token, JWT_SECRET, { issuer: JWT_ISSUER });
-    req.user = payload;
-    next();
-  } catch (err) {
+  try {} catch (err) {
     if (process.env.NODE_ENV !== 'test') {
       console.error('JWT authentication error:', err);

[Timeout] BlockStatement
src/middleware/auth.ts:17:17
     const payload = jwt.verify(token, JWT_SECRET, { issuer: JWT_ISSUER });
     req.user = payload;
     next();
-  } catch (err) {
-    if (process.env.NODE_ENV !== 'test') {
-      console.error('JWT authentication error:', err);
-    }
-    return res.status(401).json({ error: 'Invalid, expired, or unauthorized token' });
-  }
+  } catch (err) {}
 }
 

[Survived] ConditionalExpression
src/middleware/auth.ts:18:9
     req.user = payload;
     next();
   } catch (err) {
-    if (process.env.NODE_ENV !== 'test') {
+    if (false) {
       console.error('JWT authentication error:', err);
     }

[Survived] ConditionalExpression
src/middleware/auth.ts:18:9
     req.user = payload;
     next();
   } catch (err) {
-    if (process.env.NODE_ENV !== 'test') {
+    if (true) {
       console.error('JWT authentication error:', err);
     }

[Killed] ObjectLiteral
src/middleware/auth.ts:21:33
     if (process.env.NODE_ENV !== 'test') {
       console.error('JWT authentication error:', err);
     }
-    return res.status(401).json({ error: 'Invalid, expired, or unauthorized token' });
+    return res.status(401).json({});
   }
 }
killedBy: authenticateJWT middleware should return 401 for an invalid or malformed token
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "Invalid, expired, or unauthorized token",
- }
