[Timeout] BlockStatement
src/handlers/mcpHandlers.ts:8:44
 
 // Handler for /mcp/tools/list
 export function toolsListHandler(mcpTools: any[]) {
-  return (_req: Request, res: Response) => {
-    // Pagination support
-    let page = parseInt((_req.query.page as string) || '1', 10);
-    let pageSize = parseInt((_req.query.pageSize as string) || '20', 10);
-    // Ensure positive integers
-    if (isNaN(page) || page < 1) page = 1;
-    if (isNaN(pageSize) || pageSize < 1) pageSize = 20;
-    const start = (page - 1) * pageSize;
-    const end = start + pageSize;
-    const paginatedTools = mcpTools.slice(start, end);
-    res.json({
-      tools: paginatedTools,
-      page,
-      pageSize,
-      total: mcpTools.length,
-      totalPages: Math.ceil(mcpTools.length / pageSize),
-    });
-  };
+  return (_req: Request, res: Response) => {};
 }
 

[Survived] LogicalOperator
src/handlers/mcpHandlers.ts:10:25
 export function toolsListHandler(mcpTools: any[]) {
   return (_req: Request, res: Response) => {
     // Pagination support
-    let page = parseInt((_req.query.page as string) || '1', 10);
+    let page = parseInt(_req.query.page as string && '1', 10);
     let pageSize = parseInt((_req.query.pageSize as string) || '20', 10);
     // Ensure positive integers

[Survived] ConditionalExpression
src/handlers/mcpHandlers.ts:10:25
 export function toolsListHandler(mcpTools: any[]) {
   return (_req: Request, res: Response) => {
     // Pagination support
-    let page = parseInt((_req.query.page as string) || '1', 10);
+    let page = parseInt(false, 10);
     let pageSize = parseInt((_req.query.pageSize as string) || '20', 10);
     // Ensure positive integers

[Survived] LogicalOperator
src/handlers/mcpHandlers.ts:11:29
   return (_req: Request, res: Response) => {
     // Pagination support
     let page = parseInt((_req.query.page as string) || '1', 10);
-    let pageSize = parseInt((_req.query.pageSize as string) || '20', 10);
+    let pageSize = parseInt(_req.query.pageSize as string && '20', 10);
     // Ensure positive integers
     if (isNaN(page) || page < 1) page = 1;

[Survived] ConditionalExpression
src/handlers/mcpHandlers.ts:11:29
   return (_req: Request, res: Response) => {
     // Pagination support
     let page = parseInt((_req.query.page as string) || '1', 10);
-    let pageSize = parseInt((_req.query.pageSize as string) || '20', 10);
+    let pageSize = parseInt(false, 10);
     // Ensure positive integers
     if (isNaN(page) || page < 1) page = 1;

[Killed] LogicalOperator
src/handlers/mcpHandlers.ts:13:9
     let page = parseInt((_req.query.page as string) || '1', 10);
     let pageSize = parseInt((_req.query.pageSize as string) || '20', 10);
     // Ensure positive integers
-    if (isNaN(page) || page < 1) page = 1;
+    if (isNaN(page) && page < 1) page = 1;
     if (isNaN(pageSize) || pageSize < 1) pageSize = 20;
     const start = (page - 1) * pageSize;
killedBy: toolsListHandler should default to page=1 if page is 0 or negative
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/handlers/mcpHandlers.ts:13:24
     let page = parseInt((_req.query.page as string) || '1', 10);
     let pageSize = parseInt((_req.query.pageSize as string) || '20', 10);
     // Ensure positive integers
-    if (isNaN(page) || page < 1) page = 1;
+    if (isNaN(page) || page >= 1) page = 1;
     if (isNaN(pageSize) || pageSize < 1) pageSize = 20;
     const start = (page - 1) * pageSize;
killedBy: toolsListHandler should default to page=1 if page is 0 or negative
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] LogicalOperator
src/handlers/mcpHandlers.ts:14:9
     let pageSize = parseInt((_req.query.pageSize as string) || '20', 10);
     // Ensure positive integers
     if (isNaN(page) || page < 1) page = 1;
-    if (isNaN(pageSize) || pageSize < 1) pageSize = 20;
+    if (isNaN(pageSize) && pageSize < 1) pageSize = 20;
     const start = (page - 1) * pageSize;
     const end = start + pageSize;
killedBy: toolsListHandler should default to pageSize=20 if pageSize is 0 or negative
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 0

[Killed] EqualityOperator
src/handlers/mcpHandlers.ts:14:28
     let pageSize = parseInt((_req.query.pageSize as string) || '20', 10);
     // Ensure positive integers
     if (isNaN(page) || page < 1) page = 1;
-    if (isNaN(pageSize) || pageSize < 1) pageSize = 20;
+    if (isNaN(pageSize) || pageSize >= 1) pageSize = 20;
     const start = (page - 1) * pageSize;
     const end = start + pageSize;
killedBy: toolsListHandler should default to pageSize=20 if pageSize is 0 or negative
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 0

[Killed] ArithmeticOperator
src/handlers/mcpHandlers.ts:15:20
     // Ensure positive integers
     if (isNaN(page) || page < 1) page = 1;
     if (isNaN(pageSize) || pageSize < 1) pageSize = 20;
-    const start = (page - 1) * pageSize;
+    const start = (page + 1) * pageSize;
     const end = start + pageSize;
     const paginatedTools = mcpTools.slice(start, end);
killedBy: toolsListHandler should default to page=1 and pageSize=20 if not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 10

[Survived] ArithmeticOperator
src/handlers/mcpHandlers.ts:15:19
     // Ensure positive integers
     if (isNaN(page) || page < 1) page = 1;
     if (isNaN(pageSize) || pageSize < 1) pageSize = 20;
-    const start = (page - 1) * pageSize;
+    const start = (page - 1) / pageSize;
     const end = start + pageSize;
     const paginatedTools = mcpTools.slice(start, end);

[Killed] ArithmeticOperator
src/handlers/mcpHandlers.ts:16:17
     if (isNaN(page) || page < 1) page = 1;
     if (isNaN(pageSize) || pageSize < 1) pageSize = 20;
     const start = (page - 1) * pageSize;
-    const end = start + pageSize;
+    const end = start - pageSize;
     const paginatedTools = mcpTools.slice(start, end);
     res.json({
killedBy: toolsListHandler should default to page=1 and pageSize=20 if not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 30

[Killed] MethodExpression
src/handlers/mcpHandlers.ts:17:28
     if (isNaN(pageSize) || pageSize < 1) pageSize = 20;
     const start = (page - 1) * pageSize;
     const end = start + pageSize;
-    const paginatedTools = mcpTools.slice(start, end);
+    const paginatedTools = mcpTools;
     res.json({
       tools: paginatedTools,
killedBy: toolsListHandler should default to page=1 and pageSize=20 if not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 50

[Killed] ArithmeticOperator
src/handlers/mcpHandlers.ts:23:29
       page,
       pageSize,
       total: mcpTools.length,
-      totalPages: Math.ceil(mcpTools.length / pageSize),
+      totalPages: Math.ceil(mcpTools.length * pageSize),
     });
   };
killedBy: mcpHandlers toolsListHandler returns tools array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -5,7 +5,7 @@
      Object {
        "name": "foo",

[Killed] ConditionalExpression
src/handlers/mcpHandlers.ts:32:59
 export function toolsCallHandler(mcpTools: any[], _openapi: any) {
   return async (_req: Request, res: Response) => {
     const { tool, params, resumeSessionId } = res.req.body;
-    const found = mcpTools.find((t) => t.name === tool || t.id === tool);
+    const found = mcpTools.find((t) => t.name === tool || false);
     if (!found) {
       res.status(404).json({ error: 'Tool not found' });
killedBy: toolsCallHandler should return 500 if validation schema not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 404

[Killed] ConditionalExpression
src/handlers/mcpHandlers.ts:32:40
 export function toolsCallHandler(mcpTools: any[], _openapi: any) {
   return async (_req: Request, res: Response) => {
     const { tool, params, resumeSessionId } = res.req.body;
-    const found = mcpTools.find((t) => t.name === tool || t.id === tool);
+    const found = mcpTools.find((t) => false);
     if (!found) {
       res.status(404).json({ error: 'Tool not found' });
killedBy: toolsCallHandler should return 500 if validation schema not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 404

[Killed] ConditionalExpression
src/handlers/mcpHandlers.ts:33:9
   return async (_req: Request, res: Response) => {
     const { tool, params, resumeSessionId } = res.req.body;
     const found = mcpTools.find((t) => t.name === tool || t.id === tool);
-    if (!found) {
+    if (true) {
       res.status(404).json({ error: 'Tool not found' });
       return;
killedBy: toolsCallHandler should return 500 if validation schema not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 404

[Timeout] BlockStatement
src/handlers/mcpHandlers.ts:33:17
   return async (_req: Request, res: Response) => {
     const { tool, params, resumeSessionId } = res.req.body;
     const found = mcpTools.find((t) => t.name === tool || t.id === tool);
-    if (!found) {
-      res.status(404).json({ error: 'Tool not found' });
-      return;
-    }
+    if (!found) {}
     // Try to get schema by name or id
     const zodSchemas = toolZodSchemas[tool] || toolZodSchemas[found.name] || toolZodSchemas[found.id];

[Killed] StringLiteral
src/handlers/mcpHandlers.ts:34:37
     const { tool, params, resumeSessionId } = res.req.body;
     const found = mcpTools.find((t) => t.name === tool || t.id === tool);
     if (!found) {
-      res.status(404).json({ error: 'Tool not found' });
+      res.status(404).json({ error: "" });
       return;
     }
killedBy: toolsCallHandler should return 404 if tool not found
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /not found/i
Received string:  ""

[Killed] ConditionalExpression
src/handlers/mcpHandlers.ts:38:24
       return;
     }
     // Try to get schema by name or id
-    const zodSchemas = toolZodSchemas[tool] || toolZodSchemas[found.name] || toolZodSchemas[found.id];
+    const zodSchemas = true;
     if (!zodSchemas?.input) {
       res.status(500).json({ error: 'Validation schema not found for tool' });
killedBy: mcpHandlers toolsCallHandler returns 400 if input invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/handlers/mcpHandlers.ts:38:24
       return;
     }
     // Try to get schema by name or id
-    const zodSchemas = toolZodSchemas[tool] || toolZodSchemas[found.name] || toolZodSchemas[found.id];
+    const zodSchemas = false;
     if (!zodSchemas?.input) {
       res.status(500).json({ error: 'Validation schema not found for tool' });
killedBy: mcpHandlers toolsCallHandler returns 400 if input invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/handlers/mcpHandlers.ts:39:9
     }
     // Try to get schema by name or id
     const zodSchemas = toolZodSchemas[tool] || toolZodSchemas[found.name] || toolZodSchemas[found.id];
-    if (!zodSchemas?.input) {
+    if (true) {
       res.status(500).json({ error: 'Validation schema not found for tool' });
       return;
killedBy: mcpHandlers toolsCallHandler returns 400 if input invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Timeout] BlockStatement
src/handlers/mcpHandlers.ts:39:29
     }
     // Try to get schema by name or id
     const zodSchemas = toolZodSchemas[tool] || toolZodSchemas[found.name] || toolZodSchemas[found.id];
-    if (!zodSchemas?.input) {
-      res.status(500).json({ error: 'Validation schema not found for tool' });
-      return;
-    }
+    if (!zodSchemas?.input) {}
     const result = zodSchemas.input.safeParse(params);
     if (!result.success) {

[Timeout] ObjectLiteral
src/handlers/mcpHandlers.ts:40:28
     // Try to get schema by name or id
     const zodSchemas = toolZodSchemas[tool] || toolZodSchemas[found.name] || toolZodSchemas[found.id];
     if (!zodSchemas?.input) {
-      res.status(500).json({ error: 'Validation schema not found for tool' });
+      res.status(500).json({});
       return;
     }

[Killed] BlockStatement
src/handlers/mcpHandlers.ts:44:26
       return;
     }
     const result = zodSchemas.input.safeParse(params);
-    if (!result.success) {
-      res.status(400).json({ error: 'Invalid tool input', details: result.error.errors });
-      return;
-    }
+    if (!result.success) {}
     const sessionId = (res.req as any).sessionId;
     const userId = (res.req as any).user?.sub ?? 'anon';
killedBy: mcpHandlers toolsCallHandler returns 400 if input invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] ConditionalExpression
src/handlers/mcpHandlers.ts:44:9
       return;
     }
     const result = zodSchemas.input.safeParse(params);
-    if (!result.success) {
+    if (false) {
       res.status(400).json({ error: 'Invalid tool input', details: result.error.errors });
       return;
killedBy: mcpHandlers toolsCallHandler returns 400 if input invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] StringLiteral
src/handlers/mcpHandlers.ts:45:37
     }
     const result = zodSchemas.input.safeParse(params);
     if (!result.success) {
-      res.status(400).json({ error: 'Invalid tool input', details: result.error.errors });
+      res.status(400).json({ error: "", details: result.error.errors });
       return;
     }
killedBy: POST /v1/mcp/tools/call should return 400 if the input parameters are invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid tool input"
Received: ""

[Killed] ObjectLiteral
src/handlers/mcpHandlers.ts:45:28
     }
     const result = zodSchemas.input.safeParse(params);
     if (!result.success) {
-      res.status(400).json({ error: 'Invalid tool input', details: result.error.errors });
+      res.status(400).json({});
       return;
     }
killedBy: mcpHandlers toolsCallHandler returns 400 if input invalid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "details": Array [
-     "fail",

[Killed] OptionalChaining
src/handlers/mcpHandlers.ts:49:20
       return;
     }
     const sessionId = (res.req as any).sessionId;
-    const userId = (res.req as any).user?.sub ?? 'anon';
+    const userId = (res.req as any).user.sub ?? 'anon';
     let streamState;
     if (resumeSessionId) {
killedBy: POST /v1/mcp/tools/call should return 200 and a streamed result for a valid tool call
statusReason: TypeError: Cannot read properties of undefined (reading 'sub')

[Survived] LogicalOperator
src/handlers/mcpHandlers.ts:49:20
       return;
     }
     const sessionId = (res.req as any).sessionId;
-    const userId = (res.req as any).user?.sub ?? 'anon';
+    const userId = (res.req as any).user?.sub && 'anon';
     let streamState;
     if (resumeSessionId) {

[Killed] ConditionalExpression
src/handlers/mcpHandlers.ts:51:9
     const sessionId = (res.req as any).sessionId;
     const userId = (res.req as any).user?.sub ?? 'anon';
     let streamState;
-    if (resumeSessionId) {
+    if (false) {
       streamState = getStreamState(resumeSessionId);
       if (!streamState || streamState.userId !== userId) {
killedBy: mcpHandlers toolsCallHandler returns 404 for invalid resumeSessionId
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404

Number of calls: 0

[Killed] ConditionalExpression
src/handlers/mcpHandlers.ts:51:9
     const sessionId = (res.req as any).sessionId;
     const userId = (res.req as any).user?.sub ?? 'anon';
     let streamState;
-    if (resumeSessionId) {
+    if (true) {
       streamState = getStreamState(resumeSessionId);
       if (!streamState || streamState.userId !== userId) {
killedBy: POST /v1/mcp/tools/call should return 200 and a streamed result for a valid tool call
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/handlers/mcpHandlers.ts:53:11
     let streamState;
     if (resumeSessionId) {
       streamState = getStreamState(resumeSessionId);
-      if (!streamState || streamState.userId !== userId) {
+      if (false) {
         res.status(404).json({ error: 'Resumable stream not found or not authorized' });
         return;
killedBy: mcpHandlers toolsCallHandler returns 404 for invalid resumeSessionId
statusReason: TypeError: Cannot read properties of undefined (reading 'progress')

[Killed] EqualityOperator
src/handlers/mcpHandlers.ts:53:27
     let streamState;
     if (resumeSessionId) {
       streamState = getStreamState(resumeSessionId);
-      if (!streamState || streamState.userId !== userId) {
+      if (!streamState || streamState.userId === userId) {
         res.status(404).json({ error: 'Resumable stream not found or not authorized' });
         return;
killedBy: mcpHandlers toolsCallHandler returns 404 if resumable stream userId does not match
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404

Number of calls: 0

[Killed] ObjectLiteral
src/handlers/mcpHandlers.ts:54:30
     if (resumeSessionId) {
       streamState = getStreamState(resumeSessionId);
       if (!streamState || streamState.userId !== userId) {
-        res.status(404).json({ error: 'Resumable stream not found or not authorized' });
+        res.status(404).json({});
         return;
       }
killedBy: mcpHandlers toolsCallHandler returns 404 for invalid resumeSessionId
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Resumable stream not found or not authorized",
- }

[Killed] BlockStatement
src/handlers/mcpHandlers.ts:57:12
         res.status(404).json({ error: 'Resumable stream not found or not authorized' });
         return;
       }
-    } else {
-      streamState = {
-        tool,
-        params: result.data,
-        progress: 0, // Start at 0 for streaming
-        resultChunks: [], // Start empty for streaming
-        completed: false,
-        userId,
-      };
-      createStreamState(sessionId, streamState);
-    }
+    } else {}
     // In test mode, send a single JSON object for easier test assertions
     if (process.env.NODE_ENV === 'test') {
killedBy: mcpHandlers toolsCallHandler streams and completes for valid input
statusReason: TypeError: Cannot read properties of undefined (reading 'progress')

[Killed] ObjectLiteral
src/handlers/mcpHandlers.ts:58:21
         return;
       }
     } else {
-      streamState = {
-        tool,
-        params: result.data,
-        progress: 0, // Start at 0 for streaming
-        resultChunks: [], // Start empty for streaming
-        completed: false,
-        userId,
-      };
+      streamState = {};
       createStreamState(sessionId, streamState);
     }
killedBy: mcpHandlers toolsCallHandler streams all branches and cleans up stream state
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "{\"jsonrpc\":\"2.0\",\"result\":{"
Received: "},\"id\":null}
"

Number of calls: 1

[Survived] BooleanLiteral
src/handlers/mcpHandlers.ts:63:20
         params: result.data,
         progress: 0, // Start at 0 for streaming
         resultChunks: [], // Start empty for streaming
-        completed: false,
+        completed: true,
         userId,
       };

[Killed] ConditionalExpression
src/handlers/mcpHandlers.ts:69:9
       createStreamState(sessionId, streamState);
     }
     // In test mode, send a single JSON object for easier test assertions
-    if (process.env.NODE_ENV === 'test') {
+    if (false) {
       // Use progress: 1 in test mode for test compatibility
       res.json({
killedBy: mcpHandlers toolsCallHandler returns single JSON object in test mode
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"jsonrpc": "2.0", "result": ObjectContaining {"progress": 1}}

Number of calls: 0

[Killed] BlockStatement
src/handlers/mcpHandlers.ts:69:42
       createStreamState(sessionId, streamState);
     }
     // In test mode, send a single JSON object for easier test assertions
-    if (process.env.NODE_ENV === 'test') {
-      // Use progress: 1 in test mode for test compatibility
-      res.json({
-        jsonrpc: '2.0',
-        result: {
-          ...streamState,
-          progress: 1,
-          completed: true,
-          resultChunks: [{ content: params.location }],
-        },
-      });
-      return;
-    }
+    if (process.env.NODE_ENV === 'test') {}
     res.setHeader('Content-Type', 'application/json');
     res.setHeader('Transfer-Encoding', 'chunked');
killedBy: mcpHandlers toolsCallHandler returns single JSON object in test mode
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"jsonrpc": "2.0", "result": ObjectContaining {"progress": 1}}

Number of calls: 0

[Killed] ObjectLiteral
src/handlers/mcpHandlers.ts:73:17
       // Use progress: 1 in test mode for test compatibility
       res.json({
         jsonrpc: '2.0',
-        result: {
-          ...streamState,
-          progress: 1,
-          completed: true,
-          resultChunks: [{ content: params.location }],
-        },
+        result: {},
       });
       return;
killedBy: mcpHandlers toolsCallHandler returns single JSON object in test mode
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"jsonrpc": "2.0", "result": ObjectContaining {"progress": 1}}
Received: {"jsonrpc": "2.0", "result": {}}

Number of calls: 1

[Killed] BooleanLiteral
src/handlers/mcpHandlers.ts:76:22
         result: {
           ...streamState,
           progress: 1,
-          completed: true,
+          completed: false,
           resultChunks: [{ content: params.location }],
         },
killedBy: POST /v1/mcp/tools/call should return 200 and a streamed result for a valid tool call
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
src/handlers/mcpHandlers.ts:77:26
           ...streamState,
           progress: 1,
           completed: true,
-          resultChunks: [{ content: params.location }],
+          resultChunks: [{}],
         },
       });
killedBy: POST /v1/mcp/tools/call should return 200 and a streamed result for a valid tool call
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Survived] StringLiteral
src/handlers/mcpHandlers.ts:83:40
       return;
     }
     res.setHeader('Content-Type', 'application/json');
-    res.setHeader('Transfer-Encoding', 'chunked');
+    res.setHeader('Transfer-Encoding', "");
     await streamToolResult(res, streamState, sessionId);
   };

[Survived] EqualityOperator
src/handlers/mcpHandlers.ts:94:18
   streamState: any,
   sessionId: string
 ) {
-  const isTest = process.env.NODE_ENV === 'test';
+  const isTest = process.env.NODE_ENV !== 'test';
   for (let i = streamState.progress; i <= 100; i += 25) {
     if (!isTest) {

[Survived] ConditionalExpression
src/handlers/mcpHandlers.ts:94:18
   streamState: any,
   sessionId: string
 ) {
-  const isTest = process.env.NODE_ENV === 'test';
+  const isTest = false;
   for (let i = streamState.progress; i <= 100; i += 25) {
     if (!isTest) {

[Killed] BlockStatement
src/handlers/mcpHandlers.ts:95:57
   sessionId: string
 ) {
   const isTest = process.env.NODE_ENV === 'test';
-  for (let i = streamState.progress; i <= 100; i += 25) {
-    if (!isTest) {
-      await new Promise((resolve) => setTimeout(resolve, 100));
-    }
-    const chunk: { progress: string; partialResult?: any } = {
-      progress: `${i}%`,
-      partialResult: i === 100 ? sanitizeOutput({ echo: streamState.params }) : undefined,
-    };
-    res.write(i === 0 ? '{"jsonrpc":"2.0","result":{' : ',');
-    res.write(`"progress":"${chunk.progress}"`);
-    if (chunk.partialResult) {
-      res.write(`,"partialResult":${JSON.stringify(chunk.partialResult)}`);
-    }
-    streamState.progress = i;
-    streamState.resultChunks.push(chunk);
-    if (i < 100) updateStreamState(sessionId, { progress: i, resultChunks: streamState.resultChunks });
-  }
+  for (let i = streamState.progress; i <= 100; i += 25) {}
   streamState.completed = true;
   updateStreamState(sessionId, { completed: true });
killedBy: mcpHandlers toolsCallHandler streams all branches and cleans up stream state
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "{\"jsonrpc\":\"2.0\",\"result\":{"
Received: "},\"id\":null}
"

Number of calls: 1

[Killed] ConditionalExpression
src/handlers/mcpHandlers.ts:95:38
   sessionId: string
 ) {
   const isTest = process.env.NODE_ENV === 'test';
-  for (let i = streamState.progress; i <= 100; i += 25) {
+  for (let i = streamState.progress; false; i += 25) {
     if (!isTest) {
       await new Promise((resolve) => setTimeout(resolve, 100));
killedBy: mcpHandlers toolsCallHandler streams all branches and cleans up stream state
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "{\"jsonrpc\":\"2.0\",\"result\":{"
Received: "},\"id\":null}
"

Number of calls: 1

[Survived] BooleanLiteral
src/handlers/mcpHandlers.ts:96:9
 ) {
   const isTest = process.env.NODE_ENV === 'test';
   for (let i = streamState.progress; i <= 100; i += 25) {
-    if (!isTest) {
+    if (isTest) {
       await new Promise((resolve) => setTimeout(resolve, 100));
     }

[Survived] ConditionalExpression
src/handlers/mcpHandlers.ts:96:9
 ) {
   const isTest = process.env.NODE_ENV === 'test';
   for (let i = streamState.progress; i <= 100; i += 25) {
-    if (!isTest) {
+    if (true) {
       await new Promise((resolve) => setTimeout(resolve, 100));
     }

[Timeout] ArrowFunction
src/handlers/mcpHandlers.ts:97:25
   const isTest = process.env.NODE_ENV === 'test';
   for (let i = streamState.progress; i <= 100; i += 25) {
     if (!isTest) {
-      await new Promise((resolve) => setTimeout(resolve, 100));
+      await new Promise(() => undefined);
     }
     const chunk: { progress: string; partialResult?: any } = {

[Survived] EqualityOperator
src/handlers/mcpHandlers.ts:101:22
     }
     const chunk: { progress: string; partialResult?: any } = {
       progress: `${i}%`,
-      partialResult: i === 100 ? sanitizeOutput({ echo: streamState.params }) : undefined,
+      partialResult: i !== 100 ? sanitizeOutput({ echo: streamState.params }) : undefined,
     };
     res.write(i === 0 ? '{"jsonrpc":"2.0","result":{' : ',');

[Timeout] ConditionalExpression
src/handlers/mcpHandlers.ts:101:22
     }
     const chunk: { progress: string; partialResult?: any } = {
       progress: `${i}%`,
-      partialResult: i === 100 ? sanitizeOutput({ echo: streamState.params }) : undefined,
+      partialResult: false ? sanitizeOutput({ echo: streamState.params }) : undefined,
     };
     res.write(i === 0 ? '{"jsonrpc":"2.0","result":{' : ',');

[Survived] EqualityOperator
src/handlers/mcpHandlers.ts:103:15
       progress: `${i}%`,
       partialResult: i === 100 ? sanitizeOutput({ echo: streamState.params }) : undefined,
     };
-    res.write(i === 0 ? '{"jsonrpc":"2.0","result":{' : ',');
+    res.write(i !== 0 ? '{"jsonrpc":"2.0","result":{' : ',');
     res.write(`"progress":"${chunk.progress}"`);
     if (chunk.partialResult) {

[Survived] ConditionalExpression
src/handlers/mcpHandlers.ts:103:15
       progress: `${i}%`,
       partialResult: i === 100 ? sanitizeOutput({ echo: streamState.params }) : undefined,
     };
-    res.write(i === 0 ? '{"jsonrpc":"2.0","result":{' : ',');
+    res.write(true ? '{"jsonrpc":"2.0","result":{' : ',');
     res.write(`"progress":"${chunk.progress}"`);
     if (chunk.partialResult) {

[Survived] ConditionalExpression
src/handlers/mcpHandlers.ts:105:9
     };
     res.write(i === 0 ? '{"jsonrpc":"2.0","result":{' : ',');
     res.write(`"progress":"${chunk.progress}"`);
-    if (chunk.partialResult) {
+    if (true) {
       res.write(`,"partialResult":${JSON.stringify(chunk.partialResult)}`);
     }

[Timeout] BlockStatement
src/handlers/mcpHandlers.ts:105:30
     };
     res.write(i === 0 ? '{"jsonrpc":"2.0","result":{' : ',');
     res.write(`"progress":"${chunk.progress}"`);
-    if (chunk.partialResult) {
-      res.write(`,"partialResult":${JSON.stringify(chunk.partialResult)}`);
-    }
+    if (chunk.partialResult) {}
     streamState.progress = i;
     streamState.resultChunks.push(chunk);

[Survived] ConditionalExpression
src/handlers/mcpHandlers.ts:110:9
     }
     streamState.progress = i;
     streamState.resultChunks.push(chunk);
-    if (i < 100) updateStreamState(sessionId, { progress: i, resultChunks: streamState.resultChunks });
+    if (false) updateStreamState(sessionId, { progress: i, resultChunks: streamState.resultChunks });
   }
   streamState.completed = true;
