[Killed] StringLiteral
src/utils/sanitizeOutput.ts:6:46
  * For production, use a library like xss or DOMPurify for HTML.
  * This version also removes more sensitive fields, escapes more characters, prevents prototype pollution, and limits recursion depth.
  */
-const SENSITIVE_KEYS = ['password', 'token', 'secret', 'ssn', 'apikey', 'api_key'];
+const SENSITIVE_KEYS = ['password', 'token', "", 'ssn', 'apikey', 'api_key'];
 const POLLUTION_KEYS = ['__proto__', 'constructor', 'prototype'];
 const MAX_DEPTH = 20;
killedBy: sanitizeOutput removes sensitive keys from objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "data": 42,
-   "username": "user",

[Killed] ArrayDeclaration
src/utils/sanitizeOutput.ts:7:24
  * This version also removes more sensitive fields, escapes more characters, prevents prototype pollution, and limits recursion depth.
  */
 const SENSITIVE_KEYS = ['password', 'token', 'secret', 'ssn', 'apikey', 'api_key'];
-const POLLUTION_KEYS = ['__proto__', 'constructor', 'prototype'];
+const POLLUTION_KEYS = [];
 const MAX_DEPTH = 20;
 
killedBy: sanitizeOutput removes prototype pollution keys
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Object {
+   "constructor": "bad",
    "normal": 1,

[Killed] StringLiteral
src/utils/sanitizeOutput.ts:7:38
  * This version also removes more sensitive fields, escapes more characters, prevents prototype pollution, and limits recursion depth.
  */
 const SENSITIVE_KEYS = ['password', 'token', 'secret', 'ssn', 'apikey', 'api_key'];
-const POLLUTION_KEYS = ['__proto__', 'constructor', 'prototype'];
+const POLLUTION_KEYS = ['__proto__', "", 'prototype'];
 const MAX_DEPTH = 20;
 
killedBy: sanitizeOutput removes prototype pollution keys
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Object {
+   "constructor": "bad",
    "normal": 1,

[Killed] EqualityOperator
src/utils/sanitizeOutput.ts:11:7
 const MAX_DEPTH = 20;
 
 export function sanitizeOutput(obj: any, depth = 0): any {
-  if (depth >= MAX_DEPTH) return undefined;
+  if (depth < MAX_DEPTH) return undefined;
   if (Array.isArray(obj)) {
     return obj.map(item => sanitizeOutput(item, depth + 1));
killedBy: sanitizeOutput removes sensitive keys from objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": 42, "username": "user"}
Received: undefined

[Killed] ConditionalExpression
src/utils/sanitizeOutput.ts:11:7
 const MAX_DEPTH = 20;
 
 export function sanitizeOutput(obj: any, depth = 0): any {
-  if (depth >= MAX_DEPTH) return undefined;
+  if (true) return undefined;
   if (Array.isArray(obj)) {
     return obj.map(item => sanitizeOutput(item, depth + 1));
killedBy: sanitizeOutput removes sensitive keys from objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": 42, "username": "user"}
Received: undefined

[Killed] ConditionalExpression
src/utils/sanitizeOutput.ts:12:7
 
 export function sanitizeOutput(obj: any, depth = 0): any {
   if (depth >= MAX_DEPTH) return undefined;
-  if (Array.isArray(obj)) {
+  if (true) {
     return obj.map(item => sanitizeOutput(item, depth + 1));
   }
killedBy: sanitizeOutput removes sensitive keys from objects
statusReason: TypeError: obj.map is not a function

[Survived] ConditionalExpression
src/utils/sanitizeOutput.ts:12:7
 
 export function sanitizeOutput(obj: any, depth = 0): any {
   if (depth >= MAX_DEPTH) return undefined;
-  if (Array.isArray(obj)) {
+  if (false) {
     return obj.map(item => sanitizeOutput(item, depth + 1));
   }

[Killed] ArrowFunction
src/utils/sanitizeOutput.ts:13:20
 export function sanitizeOutput(obj: any, depth = 0): any {
   if (depth >= MAX_DEPTH) return undefined;
   if (Array.isArray(obj)) {
-    return obj.map(item => sanitizeOutput(item, depth + 1));
+    return obj.map(() => undefined);
   }
   if (obj && typeof obj === 'object') {
killedBy: sanitizeOutput recursively sanitizes nested objects and arrays
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"safe": "ok"}
Received: undefined

[Survived] ArithmeticOperator
src/utils/sanitizeOutput.ts:13:49
 export function sanitizeOutput(obj: any, depth = 0): any {
   if (depth >= MAX_DEPTH) return undefined;
   if (Array.isArray(obj)) {
-    return obj.map(item => sanitizeOutput(item, depth + 1));
+    return obj.map(item => sanitizeOutput(item, depth - 1));
   }
   if (obj && typeof obj === 'object') {

[Killed] ConditionalExpression
src/utils/sanitizeOutput.ts:15:7
   if (Array.isArray(obj)) {
     return obj.map(item => sanitizeOutput(item, depth + 1));
   }
-  if (obj && typeof obj === 'object') {
+  if (true) {
     const clean: Record<string, any> = {};
     for (const [k, v] of Object.entries(obj)) {
killedBy: sanitizeOutput string fallback should return the original character if not in the replacement map
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "☃"
Received: {}

[Killed] ConditionalExpression
src/utils/sanitizeOutput.ts:15:14
   if (Array.isArray(obj)) {
     return obj.map(item => sanitizeOutput(item, depth + 1));
   }
-  if (obj && typeof obj === 'object') {
+  if (obj && true) {
     const clean: Record<string, any> = {};
     for (const [k, v] of Object.entries(obj)) {
killedBy: sanitizeOutput removes sensitive keys from objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "data": 42,
-   "username": "user",

[Killed] BlockStatement
src/utils/sanitizeOutput.ts:17:47
   }
   if (obj && typeof obj === 'object') {
     const clean: Record<string, any> = {};
-    for (const [k, v] of Object.entries(obj)) {
-      const keyLower = k.toLowerCase();
-      if (SENSITIVE_KEYS.some(s => keyLower.includes(s))) continue;
-      if (POLLUTION_KEYS.includes(k)) continue;
-      const sanitized = sanitizeOutput(v, depth + 1);
-      if (sanitized !== undefined) {
-        clean[k] = sanitized;
-      }
-    }
+    for (const [k, v] of Object.entries(obj)) {}
     // If the object is empty, return undefined (unless it's the root)
     if (Object.keys(clean).length === 0 && depth !== 0) return undefined;
killedBy: sanitizeOutput removes sensitive keys from objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "data": 42,
-   "username": "user",

[Killed] MethodExpression
src/utils/sanitizeOutput.ts:18:24
   if (obj && typeof obj === 'object') {
     const clean: Record<string, any> = {};
     for (const [k, v] of Object.entries(obj)) {
-      const keyLower = k.toLowerCase();
+      const keyLower = k.toUpperCase();
       if (SENSITIVE_KEYS.some(s => keyLower.includes(s))) continue;
       if (POLLUTION_KEYS.includes(k)) continue;
killedBy: sanitizeOutput removes sensitive keys from objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Object {
    "data": 42,
+   "password": "123",

[Killed] MethodExpression
src/utils/sanitizeOutput.ts:19:11
     const clean: Record<string, any> = {};
     for (const [k, v] of Object.entries(obj)) {
       const keyLower = k.toLowerCase();
-      if (SENSITIVE_KEYS.some(s => keyLower.includes(s))) continue;
+      if (SENSITIVE_KEYS.every(s => keyLower.includes(s))) continue;
       if (POLLUTION_KEYS.includes(k)) continue;
       const sanitized = sanitizeOutput(v, depth + 1);
killedBy: sanitizeOutput removes sensitive keys from objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Object {
    "data": 42,
+   "password": "123",

[Killed] ConditionalExpression
src/utils/sanitizeOutput.ts:19:11
     const clean: Record<string, any> = {};
     for (const [k, v] of Object.entries(obj)) {
       const keyLower = k.toLowerCase();
-      if (SENSITIVE_KEYS.some(s => keyLower.includes(s))) continue;
+      if (false) continue;
       if (POLLUTION_KEYS.includes(k)) continue;
       const sanitized = sanitizeOutput(v, depth + 1);
killedBy: sanitizeOutput removes sensitive keys from objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Object {
    "data": 42,
+   "password": "123",

[Killed] ConditionalExpression
src/utils/sanitizeOutput.ts:20:11
     for (const [k, v] of Object.entries(obj)) {
       const keyLower = k.toLowerCase();
       if (SENSITIVE_KEYS.some(s => keyLower.includes(s))) continue;
-      if (POLLUTION_KEYS.includes(k)) continue;
+      if (false) continue;
       const sanitized = sanitizeOutput(v, depth + 1);
       if (sanitized !== undefined) {
killedBy: sanitizeOutput removes prototype pollution keys
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Object {
+   "constructor": "bad",
    "normal": 1,

[Killed] ConditionalExpression
src/utils/sanitizeOutput.ts:20:11
     for (const [k, v] of Object.entries(obj)) {
       const keyLower = k.toLowerCase();
       if (SENSITIVE_KEYS.some(s => keyLower.includes(s))) continue;
-      if (POLLUTION_KEYS.includes(k)) continue;
+      if (true) continue;
       const sanitized = sanitizeOutput(v, depth + 1);
       if (sanitized !== undefined) {
killedBy: sanitizeOutput removes sensitive keys from objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "data": 42,
-   "username": "user",

[Survived] ArithmeticOperator
src/utils/sanitizeOutput.ts:21:43
       const keyLower = k.toLowerCase();
       if (SENSITIVE_KEYS.some(s => keyLower.includes(s))) continue;
       if (POLLUTION_KEYS.includes(k)) continue;
-      const sanitized = sanitizeOutput(v, depth + 1);
+      const sanitized = sanitizeOutput(v, depth - 1);
       if (sanitized !== undefined) {
         clean[k] = sanitized;

[Killed] EqualityOperator
src/utils/sanitizeOutput.ts:22:11
       if (SENSITIVE_KEYS.some(s => keyLower.includes(s))) continue;
       if (POLLUTION_KEYS.includes(k)) continue;
       const sanitized = sanitizeOutput(v, depth + 1);
-      if (sanitized !== undefined) {
+      if (sanitized === undefined) {
         clean[k] = sanitized;
       }
killedBy: sanitizeOutput removes sensitive keys from objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "data": 42,
-   "username": "user",

[Killed] BlockStatement
src/utils/sanitizeOutput.ts:22:36
       if (SENSITIVE_KEYS.some(s => keyLower.includes(s))) continue;
       if (POLLUTION_KEYS.includes(k)) continue;
       const sanitized = sanitizeOutput(v, depth + 1);
-      if (sanitized !== undefined) {
-        clean[k] = sanitized;
-      }
+      if (sanitized !== undefined) {}
     }
     // If the object is empty, return undefined (unless it's the root)
killedBy: sanitizeOutput removes sensitive keys from objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "data": 42,
-   "username": "user",

[Killed] ConditionalExpression
src/utils/sanitizeOutput.ts:27:9
       }
     }
     // If the object is empty, return undefined (unless it's the root)
-    if (Object.keys(clean).length === 0 && depth !== 0) return undefined;
+    if (true) return undefined;
     return clean;
   }
killedBy: sanitizeOutput removes sensitive keys from objects
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": 42, "username": "user"}
Received: undefined

[Killed] ConditionalExpression
src/utils/sanitizeOutput.ts:27:9
       }
     }
     // If the object is empty, return undefined (unless it's the root)
-    if (Object.keys(clean).length === 0 && depth !== 0) return undefined;
+    if (true && depth !== 0) return undefined;
     return clean;
   }
killedBy: sanitizeOutput recursively sanitizes nested objects and arrays
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"safe": "ok"}
Received: undefined

[Killed] ConditionalExpression
src/utils/sanitizeOutput.ts:30:7
     if (Object.keys(clean).length === 0 && depth !== 0) return undefined;
     return clean;
   }
-  if (typeof obj === 'string') {
+  if (false) {
     return obj.replace(/[<>&"'`]/g, c => ({
       '<': '&lt;',
killedBy: sanitizeOutput escapes dangerous characters in strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&lt;script&gt;alert(&quot;xss&quot;)&lt;/script&gt;"
Received: "<script>alert(\"xss\")</script>"

[Killed] ConditionalExpression
src/utils/sanitizeOutput.ts:30:7
     if (Object.keys(clean).length === 0 && depth !== 0) return undefined;
     return clean;
   }
-  if (typeof obj === 'string') {
+  if (true) {
     return obj.replace(/[<>&"'`]/g, c => ({
       '<': '&lt;',
killedBy: sanitizeOutput removes sensitive keys from objects
statusReason: TypeError: obj.replace is not a function

[Killed] LogicalOperator
src/utils/sanitizeOutput.ts:31:43
     return clean;
   }
   if (typeof obj === 'string') {
-    return obj.replace(/[<>&"'`]/g, c => ({
-      '<': '&lt;',
-      '>': '&gt;',
-      '&': '&amp;',
-      '"': '&quot;',
-      "'": '&#39;',
-      '`': '&#96;'
-    }[c] ?? c));
+    return obj.replace(/[<>&"'`]/g, c => ({
+  '<': '&lt;',
+  '>': '&gt;',
+  '&': '&amp;',
+  '"': '&quot;',
+  "'": '&#39;',
+  '`': '&#96;'
+}[c] && c));
   }
   return obj;
killedBy: sanitizeOutput escapes dangerous characters in strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&lt;script&gt;alert(&quot;xss&quot;)&lt;/script&gt;"
Received: "<script>alert(\"xss\")</script>"

[Killed] ArrowFunction
src/utils/sanitizeOutput.ts:31:37
     return clean;
   }
   if (typeof obj === 'string') {
-    return obj.replace(/[<>&"'`]/g, c => ({
-      '<': '&lt;',
-      '>': '&gt;',
-      '&': '&amp;',
-      '"': '&quot;',
-      "'": '&#39;',
-      '`': '&#96;'
-    }[c] ?? c));
+    return obj.replace(/[<>&"'`]/g, () => undefined);
   }
   return obj;
killedBy: sanitizeOutput escapes dangerous characters in strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&lt;script&gt;alert(&quot;xss&quot;)&lt;/script&gt;"
Received: "undefinedscriptundefinedalert(undefinedxssundefined)undefined/scriptundefined"

[Killed] StringLiteral
src/utils/sanitizeOutput.ts:37:12
       '&': '&amp;',
       '"': '&quot;',
       "'": '&#39;',
-      '`': '&#96;'
+      '`': ""
     }[c] ?? c));
   }
killedBy: sanitizeOutput escapes dangerous characters in strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;single&#39; and &#96;backtick&#96;"
Received: "&quot;single&#39; and backtick"
