[Survived] ConditionalExpression
src/handlers/mcpHandlers.ts:110:9
     }
     streamState.progress = i;
     streamState.resultChunks.push(chunk);
-    if (i < 100) updateStreamState(sessionId, { progress: i, resultChunks: streamState.resultChunks });
+    if (true) updateStreamState(sessionId, { progress: i, resultChunks: streamState.resultChunks });
   }
   streamState.completed = true;

[Survived] BooleanLiteral
src/handlers/mcpHandlers.ts:112:27
     streamState.resultChunks.push(chunk);
     if (i < 100) updateStreamState(sessionId, { progress: i, resultChunks: streamState.resultChunks });
   }
-  streamState.completed = true;
+  streamState.completed = false;
   updateStreamState(sessionId, { completed: true });
   res.write('},"id":null}\n');

[Survived] BooleanLiteral
src/handlers/mcpHandlers.ts:113:45
     if (i < 100) updateStreamState(sessionId, { progress: i, resultChunks: streamState.resultChunks });
   }
   streamState.completed = true;
-  updateStreamState(sessionId, { completed: true });
+  updateStreamState(sessionId, { completed: false });
   res.write('},"id":null}\n');
   res.end();

[Survived] ObjectLiteral
src/handlers/mcpHandlers.ts:113:32
     if (i < 100) updateStreamState(sessionId, { progress: i, resultChunks: streamState.resultChunks });
   }
   streamState.completed = true;
-  updateStreamState(sessionId, { completed: true });
+  updateStreamState(sessionId, {});
   res.write('},"id":null}\n');
   res.end();

[Timeout] ArrowFunction
src/handlers/mcpHandlers.ts:117:30
   res.write('},"id":null}\n');
   res.end();
   // Clean up finished streams
-  const timeout = setTimeout(() => deleteStreamState(sessionId), 60000);
+  const timeout = setTimeout(() => undefined, 60000);
   if (typeof timeout.unref === 'function') timeout.unref();
 }

[Survived] EqualityOperator
src/handlers/mcpHandlers.ts:118:7
   res.end();
   // Clean up finished streams
   const timeout = setTimeout(() => deleteStreamState(sessionId), 60000);
-  if (typeof timeout.unref === 'function') timeout.unref();
+  if (typeof timeout.unref !== 'function') timeout.unref();
 }
 

[Survived] ConditionalExpression
src/handlers/mcpHandlers.ts:118:7
   res.end();
   // Clean up finished streams
   const timeout = setTimeout(() => deleteStreamState(sessionId), 60000);
-  if (typeof timeout.unref === 'function') timeout.unref();
+  if (false) timeout.unref();
 }
 

[Killed] BlockStatement
src/handlers/mcpHandlers.ts:123:44
 
 // Handler for /mcp/notifications/tools/list_changed (SSE or polling)
 export function notificationsListChangedHandler() {
-  return (_req: Request, res: Response) => {
-    // For now, just return a static notification
-    res.json({ changed: false });
-  };
+  return (_req: Request, res: Response) => {};
 }
 
killedBy: mcpHandlers notificationsListChangedHandler returns changed: false
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"changed": false}

Number of calls: 0

[Killed] BooleanLiteral
src/handlers/mcpHandlers.ts:125:25
 export function notificationsListChangedHandler() {
   return (_req: Request, res: Response) => {
     // For now, just return a static notification
-    res.json({ changed: false });
+    res.json({ changed: true });
   };
 }
killedBy: mcpHandlers notificationsListChangedHandler returns changed: false
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "changed": false,
+   "changed": true,
