[Timeout] ArrowFunction
src/index.ts:21:23
   app.use(requestLogger); // Log all requests
 
   // Health check endpoint
-  app.get('/healthz', (_req, res) => res.status(200).json({ status: 'ok' }));
+  app.get('/healthz', () => undefined);
 
   app.use(authenticateJWT); // Protect all routes after this line

[Killed] StringLiteral
src/index.ts:21:11
   app.use(requestLogger); // Log all requests
 
   // Health check endpoint
-  app.get('/healthz', (_req, res) => res.status(200).json({ status: 'ok' }));
+  app.get("", (_req, res) => res.status(200).json({ status: 'ok' }));
 
   app.use(authenticateJWT); // Protect all routes after this line
killedBy: index.ts (Express app) should respond to /healthz
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] EqualityOperator
src/index.ts:27:7
   app.use(sessionMiddleware); // Add session management after authentication
 
   // Apply rate limiting to all routes after this line, but disable it for tests
-  if (process.env.NODE_ENV !== 'test') {
+  if (process.env.NODE_ENV === 'test') {
     app.use(mcpRateLimiter);
   }
killedBy: index.ts (Express app) middleware and error handler coverage applies rate limiter when NODE_ENV is not test (functional)
statusReason: Error: socket hang up

[Survived] ConditionalExpression
src/index.ts:27:7
   app.use(sessionMiddleware); // Add session management after authentication
 
   // Apply rate limiting to all routes after this line, but disable it for tests
-  if (process.env.NODE_ENV !== 'test') {
+  if (false) {
     app.use(mcpRateLimiter);
   }

[Killed] StringLiteral
src/index.ts:32:35
   }
 
   // Load OpenAPI and MCP tool definitions at startup
-  const openapi = loadOpenApiSpec('config/openapi.json');
+  const openapi = loadOpenApiSpec("");
   const mcpTools = extractMcpToolsFromOpenApi(openapi);
 
killedBy: index.ts (Express app) should respond to /healthz
statusReason: Error: EISDIR: illegal operation on a directory, read

[Survived] StringLiteral
src/index.ts:46:12
   app.use('/v1', v1);
 
   // Legacy (unversioned) endpoints for backward compatibility (optional, can deprecate later)
-  app.post('/mcp/tools/list', toolsListHandler(mcpTools));
+  app.post("", toolsListHandler(mcpTools));
   app.post('/mcp/tools/call', toolsCallHandler(mcpTools, openapi));
   app.get('/mcp/notifications/tools/list_changed', notificationsListChangedHandler());

[Survived] StringLiteral
src/index.ts:47:12
 
   // Legacy (unversioned) endpoints for backward compatibility (optional, can deprecate later)
   app.post('/mcp/tools/list', toolsListHandler(mcpTools));
-  app.post('/mcp/tools/call', toolsCallHandler(mcpTools, openapi));
+  app.post("", toolsCallHandler(mcpTools, openapi));
   app.get('/mcp/notifications/tools/list_changed', notificationsListChangedHandler());
 

[Survived] StringLiteral
src/index.ts:48:11
   // Legacy (unversioned) endpoints for backward compatibility (optional, can deprecate later)
   app.post('/mcp/tools/list', toolsListHandler(mcpTools));
   app.post('/mcp/tools/call', toolsCallHandler(mcpTools, openapi));
-  app.get('/mcp/notifications/tools/list_changed', notificationsListChangedHandler());
+  app.get("", notificationsListChangedHandler());
 
   // Add a catch-all 404 handler before the error handler

[Timeout] BlockStatement
src/index.ts:51:32
   app.get('/mcp/notifications/tools/list_changed', notificationsListChangedHandler());
 
   // Add a catch-all 404 handler before the error handler
-  app.use((_req, res, next) => {
-    const err: any = new Error('Not Found');
-    err.status = 404;
-    next(err);
-  });
+  app.use((_req, res, next) => {});
   app.use(errorHandler); // Add error handling middleware at the end
 

[Killed] StringLiteral
src/index.ts:52:32
 
   // Add a catch-all 404 handler before the error handler
   app.use((_req, res, next) => {
-    const err: any = new Error('Not Found');
+    const err: any = new Error("");
     err.status = 404;
     next(err);
killedBy: index.ts (Express app) middleware and error handler coverage should 404 for unknown route (auth bypassed)
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /not found/i
Received string:  "Internal Server Error"

[Killed] EqualityOperator
src/index.ts:62:22
 }
 
 // Start the server only if this file is run directly (not imported as a module)
-const isMainModule = require.main === module;
+const isMainModule = require.main !== module;
 
 if (isMainModule) {
killedBy: GET /v1/mcp/notifications/tools/list_changed should return 200 OK with changed: false
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Killed] ConditionalExpression
src/index.ts:62:22
 }
 
 // Start the server only if this file is run directly (not imported as a module)
-const isMainModule = require.main === module;
+const isMainModule = true;
 
 if (isMainModule) {
killedBy: index.ts (Express app) should respond to /healthz
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Killed] ConditionalExpression
src/index.ts:64:5
 // Start the server only if this file is run directly (not imported as a module)
 const isMainModule = require.main === module;
 
-if (isMainModule) {
+if (true) {
   const app = createApp();
   const port = process.env.PORT || 3000;
killedBy: GET /v1/mcp/notifications/tools/list_changed should return 200 OK with changed: false
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Survived] BlockStatement
src/index.ts:64:19
 // Start the server only if this file is run directly (not imported as a module)
 const isMainModule = require.main === module;
 
-if (isMainModule) {
-  const app = createApp();
-  const port = process.env.PORT || 3000;
-  app.listen(port, () => {
-    // eslint-disable-next-line no-console
-    console.log(`MCP server listening on port ${port}`);
-  });
-}
+if (isMainModule) {}
 

[Survived] ConditionalExpression
src/index.ts:66:16
 
 if (isMainModule) {
   const app = createApp();
-  const port = process.env.PORT || 3000;
+  const port = true;
   app.listen(port, () => {
     // eslint-disable-next-line no-console

[Survived] ConditionalExpression
src/index.ts:66:16
 
 if (isMainModule) {
   const app = createApp();
-  const port = process.env.PORT || 3000;
+  const port = false;
   app.listen(port, () => {
     // eslint-disable-next-line no-console

[Survived] BlockStatement
src/index.ts:67:26
 if (isMainModule) {
   const app = createApp();
   const port = process.env.PORT || 3000;
-  app.listen(port, () => {
-    // eslint-disable-next-line no-console
-    console.log(`MCP server listening on port ${port}`);
-  });
+  app.listen(port, () => {});
 }
 

[Survived] StringLiteral
src/index.ts:69:17
   const port = process.env.PORT || 3000;
   app.listen(port, () => {
     // eslint-disable-next-line no-console
-    console.log(`MCP server listening on port ${port}`);
+    console.log(``);
   });
 }
