[Timeout] BlockStatement
src/middleware/errorHandler.ts:4:89
 import { Request, Response, NextFunction } from 'express';
 import logger from '../utils/logger';
 
-export function errorHandler(err: any, req: Request, res: Response, next: NextFunction) {
-  logger.error({
-    err,
-    url: req.originalUrl,
-    method: req.method,
-    user: (req as any).user?.sub || 'anon',
-    sessionId: (req as any).sessionId || null,
-    stack: err.stack,
-  }, 'Error occurred');
-
-  if (res.headersSent) {
-    return next(err);
-  }
-
-  res.setHeader('Content-Type', 'application/json');
-  const status = err.status || 500;
-  const isProd = process.env.NODE_ENV === 'production';
-
-  res.status(status).json({
-    error: err.message || 'Internal Server Error',
-    code: err.code || 'ERR_INTERNAL',
-    ...(err.details && !isProd ? { details: err.details } : {}),
-    ...(isProd ? {} : { stack: err.stack }),
-  });
-}
+export function errorHandler(err: any, req: Request, res: Response, next: NextFunction) {}
 

[Killed] OptionalChaining
src/middleware/errorHandler.ts:9:11
     err,
     url: req.originalUrl,
     method: req.method,
-    user: (req as any).user?.sub || 'anon',
+    user: (req as any).user.sub || 'anon',
     sessionId: (req as any).sessionId || null,
     stack: err.stack,
killedBy: index.ts (Express app) middleware and error handler coverage should 404 for unknown route (auth bypassed)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] ConditionalExpression
src/middleware/errorHandler.ts:9:11
     err,
     url: req.originalUrl,
     method: req.method,
-    user: (req as any).user?.sub || 'anon',
+    user: false,
     sessionId: (req as any).sessionId || null,
     stack: err.stack,
killedBy: errorHandler should log anon user and null sessionId if missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"sessionId": null, "user": "anon"}, Any<String>
Received: {"err": [Error: fail!], "method": "GET", "sessionId": null, "stack": "Error: fail!

[Killed] LogicalOperator
src/middleware/errorHandler.ts:10:16
     url: req.originalUrl,
     method: req.method,
     user: (req as any).user?.sub || 'anon',
-    sessionId: (req as any).sessionId || null,
+    sessionId: (req as any).sessionId && null,
     stack: err.stack,
   }, 'Error occurred');
killedBy: errorHandler should log anon user and null sessionId if missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"sessionId": null, "user": "anon"}, Any<String>
Received: {"err": [Error: fail!], "method": "GET", "sessionId": undefined, "stack": "Error: fail!

[Killed] ConditionalExpression
src/middleware/errorHandler.ts:10:16
     url: req.originalUrl,
     method: req.method,
     user: (req as any).user?.sub || 'anon',
-    sessionId: (req as any).sessionId || null,
+    sessionId: false,
     stack: err.stack,
   }, 'Error occurred');
killedBy: errorHandler should log anon user and null sessionId if missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"sessionId": null, "user": "anon"}, Any<String>
Received: {"err": [Error: fail!], "method": "GET", "sessionId": false, "stack": "Error: fail!

[Survived] StringLiteral
src/middleware/errorHandler.ts:12:6
     user: (req as any).user?.sub || 'anon',
     sessionId: (req as any).sessionId || null,
     stack: err.stack,
-  }, 'Error occurred');
+  }, "");
 
   if (res.headersSent) {

[Killed] BlockStatement
src/middleware/errorHandler.ts:14:24
     stack: err.stack,
   }, 'Error occurred');
 
-  if (res.headersSent) {
-    return next(err);
-  }
+  if (res.headersSent) {}
 
   res.setHeader('Content-Type', 'application/json');
killedBy: errorHandler should call next(err) if headersSent
statusReason: TypeError: res.setHeader is not a function

[Killed] ConditionalExpression
src/middleware/errorHandler.ts:14:7
     stack: err.stack,
   }, 'Error occurred');
 
-  if (res.headersSent) {
+  if (false) {
     return next(err);
   }
killedBy: errorHandler should call next(err) if headersSent
statusReason: TypeError: res.setHeader is not a function

[Killed] StringLiteral
src/middleware/errorHandler.ts:18:33
     return next(err);
   }
 
-  res.setHeader('Content-Type', 'application/json');
+  res.setHeader('Content-Type', "");
   const status = err.status || 500;
   const isProd = process.env.NODE_ENV === 'production';
killedBy: errorHandler logs and returns error response with code and stack (non-prod)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Content-Type", "application/json"
Received: "Content-Type", ""

Number of calls: 1

[Killed] LogicalOperator
src/middleware/errorHandler.ts:19:18
   }
 
   res.setHeader('Content-Type', 'application/json');
-  const status = err.status || 500;
+  const status = err.status && 500;
   const isProd = process.env.NODE_ENV === 'production';
 
killedBy: errorHandler should log error and return 500 with details and stack in non-prod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "fail!"
Received: undefined

[Killed] ConditionalExpression
src/middleware/errorHandler.ts:19:18
   }
 
   res.setHeader('Content-Type', 'application/json');
-  const status = err.status || 500;
+  const status = true;
   const isProd = process.env.NODE_ENV === 'production';
 
killedBy: errorHandler should log error and return 500 with details and stack in non-prod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "fail!"
Received: undefined

[Killed] EqualityOperator
src/middleware/errorHandler.ts:20:18
 
   res.setHeader('Content-Type', 'application/json');
   const status = err.status || 500;
-  const isProd = process.env.NODE_ENV === 'production';
+  const isProd = process.env.NODE_ENV !== 'production';
 
   res.status(status).json({
killedBy: errorHandler should log error and return 500 with details and stack in non-prod
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"foo": "bar"}
Received: undefined

[Killed] ConditionalExpression
src/middleware/errorHandler.ts:20:18
 
   res.setHeader('Content-Type', 'application/json');
   const status = err.status || 500;
-  const isProd = process.env.NODE_ENV === 'production';
+  const isProd = true;
 
   res.status(status).json({
killedBy: errorHandler should log error and return 500 with details and stack in non-prod
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"foo": "bar"}
Received: undefined

[Killed] LogicalOperator
src/middleware/errorHandler.ts:23:12
   const isProd = process.env.NODE_ENV === 'production';
 
   res.status(status).json({
-    error: err.message || 'Internal Server Error',
+    error: err.message && 'Internal Server Error',
     code: err.code || 'ERR_INTERNAL',
     ...(err.details && !isProd ? { details: err.details } : {}),
killedBy: errorHandler should log error and return 500 with details and stack in non-prod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "fail!"
Received: "Internal Server Error"

[Killed] ConditionalExpression
src/middleware/errorHandler.ts:23:12
   const isProd = process.env.NODE_ENV === 'production';
 
   res.status(status).json({
-    error: err.message || 'Internal Server Error',
+    error: true,
     code: err.code || 'ERR_INTERNAL',
     ...(err.details && !isProd ? { details: err.details } : {}),
killedBy: errorHandler should log error and return 500 with details and stack in non-prod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "fail!"
Received: true

[Killed] LogicalOperator
src/middleware/errorHandler.ts:24:11
 
   res.status(status).json({
     error: err.message || 'Internal Server Error',
-    code: err.code || 'ERR_INTERNAL',
+    code: err.code && 'ERR_INTERNAL',
     ...(err.details && !isProd ? { details: err.details } : {}),
     ...(isProd ? {} : { stack: err.stack }),
killedBy: errorHandler should log error and return 500 with details and stack in non-prod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ERR_TEST"
Received: "ERR_INTERNAL"

[Killed] ConditionalExpression
src/middleware/errorHandler.ts:24:11
 
   res.status(status).json({
     error: err.message || 'Internal Server Error',
-    code: err.code || 'ERR_INTERNAL',
+    code: false,
     ...(err.details && !isProd ? { details: err.details } : {}),
     ...(isProd ? {} : { stack: err.stack }),
killedBy: errorHandler should log error and return 500 with details and stack in non-prod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ERR_TEST"
Received: false

[Killed] LogicalOperator
src/middleware/errorHandler.ts:25:9
   res.status(status).json({
     error: err.message || 'Internal Server Error',
     code: err.code || 'ERR_INTERNAL',
-    ...(err.details && !isProd ? { details: err.details } : {}),
+    ...(err.details || !isProd ? { details: err.details } : {}),
     ...(isProd ? {} : { stack: err.stack }),
   });
killedBy: errorHandler should omit details and stack in production
statusReason: Error: expect(received).toBeUndefined()

Received: {"foo": "bar"}

[Killed] ConditionalExpression
src/middleware/errorHandler.ts:25:9
   res.status(status).json({
     error: err.message || 'Internal Server Error',
     code: err.code || 'ERR_INTERNAL',
-    ...(err.details && !isProd ? { details: err.details } : {}),
+    ...(true ? { details: err.details } : {}),
     ...(isProd ? {} : { stack: err.stack }),
   });
killedBy: errorHandler should omit details and stack in production
statusReason: Error: expect(received).toBeUndefined()

Received: {"foo": "bar"}
