[Killed] BlockStatement
src/middleware/rateLimit.ts:11:41
 };
 
 // Factory to create a rate limiter for a given endpoint and user role
-function createRateLimiter(max: number) {
-  return require('express-rate-limit')({
-    windowMs: 60 * 1000,
-    max,
-    standardHeaders: true,
-    legacyHeaders: false,
-    message: { error: 'Too many requests, please try again later.' },
-    handler: (_req: Request, response: any, _next: any, options: Options) => {
-      response.set('X-RateLimit-Limit', (options.max ?? 60).toString());
-      response.set('X-RateLimit-Remaining', '0');
-      response.set('X-RateLimit-Reset', (Math.floor(Date.now() / 1000) + 60).toString());
-      response.status(429).json(options.message);
-    }
-  });
-}
+function createRateLimiter(max: number) {}
 
 // Pre-create limiters for each endpoint and role
killedBy: should use default admin limit for unknown endpoint with admin user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ArithmeticOperator
src/middleware/rateLimit.ts:13:15
 // Factory to create a rate limiter for a given endpoint and user role
 function createRateLimiter(max: number) {
   return require('express-rate-limit')({
-    windowMs: 60 * 1000,
+    windowMs: 60 / 1000,
     max,
     standardHeaders: true,
killedBy: mcpRateLimiter should rate limit after max for /v1/mcp/tools/list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 429
Received: 200

[Survived] BooleanLiteral
src/middleware/rateLimit.ts:15:22
   return require('express-rate-limit')({
     windowMs: 60 * 1000,
     max,
-    standardHeaders: true,
+    standardHeaders: false,
     legacyHeaders: false,
     message: { error: 'Too many requests, please try again later.' },

[Killed] StringLiteral
src/middleware/rateLimit.ts:17:23
     max,
     standardHeaders: true,
     legacyHeaders: false,
-    message: { error: 'Too many requests, please try again later.' },
+    message: { error: "" },
     handler: (_req: Request, response: any, _next: any, options: Options) => {
       response.set('X-RateLimit-Limit', (options.max ?? 60).toString());
killedBy: mcpRateLimiter should rate limit after max for /v1/mcp/tools/list
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /too many requests/i
Received string:  ""

[Timeout] BlockStatement
src/middleware/rateLimit.ts:18:78
     standardHeaders: true,
     legacyHeaders: false,
     message: { error: 'Too many requests, please try again later.' },
-    handler: (_req: Request, response: any, _next: any, options: Options) => {
-      response.set('X-RateLimit-Limit', (options.max ?? 60).toString());
-      response.set('X-RateLimit-Remaining', '0');
-      response.set('X-RateLimit-Reset', (Math.floor(Date.now() / 1000) + 60).toString());
-      response.status(429).json(options.message);
-    }
+    handler: (_req: Request, response: any, _next: any, options: Options) => {}
   });
 }

[Survived] LogicalOperator
src/middleware/rateLimit.ts:19:42
     legacyHeaders: false,
     message: { error: 'Too many requests, please try again later.' },
     handler: (_req: Request, response: any, _next: any, options: Options) => {
-      response.set('X-RateLimit-Limit', (options.max ?? 60).toString());
+      response.set('X-RateLimit-Limit', (options.max && 60).toString());
       response.set('X-RateLimit-Remaining', '0');
       response.set('X-RateLimit-Reset', (Math.floor(Date.now() / 1000) + 60).toString());

[Killed] StringLiteral
src/middleware/rateLimit.ts:20:20
     message: { error: 'Too many requests, please try again later.' },
     handler: (_req: Request, response: any, _next: any, options: Options) => {
       response.set('X-RateLimit-Limit', (options.max ?? 60).toString());
-      response.set('X-RateLimit-Remaining', '0');
+      response.set("", '0');
       response.set('X-RateLimit-Reset', (Math.floor(Date.now() / 1000) + 60).toString());
       response.status(429).json(options.message);
killedBy: mcpRateLimiter should rate limit after max for /v1/mcp/tools/list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 429
Received: 500

[Killed] ArithmeticOperator
src/middleware/rateLimit.ts:21:42
     handler: (_req: Request, response: any, _next: any, options: Options) => {
       response.set('X-RateLimit-Limit', (options.max ?? 60).toString());
       response.set('X-RateLimit-Remaining', '0');
-      response.set('X-RateLimit-Reset', (Math.floor(Date.now() / 1000) + 60).toString());
+      response.set('X-RateLimit-Reset', (Math.floor(Date.now() / 1000) - 60).toString());
       response.status(429).json(options.message);
     }
killedBy: mcpRateLimiter should default to user role if req.user is an object without role
statusReason: Error: Parse Error: Expected HTTP/, RTSP/ or ICE/

[Survived] ArithmeticOperator
src/middleware/rateLimit.ts:21:53
     handler: (_req: Request, response: any, _next: any, options: Options) => {
       response.set('X-RateLimit-Limit', (options.max ?? 60).toString());
       response.set('X-RateLimit-Remaining', '0');
-      response.set('X-RateLimit-Reset', (Math.floor(Date.now() / 1000) + 60).toString());
+      response.set('X-RateLimit-Reset', (Math.floor(Date.now() * 1000) + 60).toString());
       response.status(429).json(options.message);
     }

[Survived] BlockStatement
src/middleware/rateLimit.ts:29:66
 
 // Pre-create limiters for each endpoint and role
 const limiters: Record<string, RateLimitRequestHandler> = {};
-Object.entries(endpointRateLimits).forEach(([route, { max }]) => {
-  limiters[`${route}:user`] = createRateLimiter(max);
-  limiters[`${route}:admin`] = createRateLimiter(1000);
-});
+Object.entries(endpointRateLimits).forEach(([route, { max }]) => {});
 limiters['default:user'] = createRateLimiter(60);
 limiters['default:admin'] = createRateLimiter(1000);

[Killed] StringLiteral
src/middleware/rateLimit.ts:33:10
   limiters[`${route}:user`] = createRateLimiter(max);
   limiters[`${route}:admin`] = createRateLimiter(1000);
 });
-limiters['default:user'] = createRateLimiter(60);
+limiters[""] = createRateLimiter(60);
 limiters['default:admin'] = createRateLimiter(1000);
 
killedBy: mcpRateLimiter should allow requests under the limit for /v1/mcp/tools/list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Timeout] BlockStatement
src/middleware/rateLimit.ts:36:67
 limiters['default:user'] = createRateLimiter(60);
 limiters['default:admin'] = createRateLimiter(1000);
 
-export function mcpRateLimiter(req: Request, res: any, next: any) {
-  const key = req.baseUrl + req.path;
-  // Defensive: req.user may be string, JwtPayload, or undefined
-  let role = 'user';
-  if (typeof req.user === 'object' && req.user !== null && 'role' in req.user && req.user.role === 'admin') {
-    role = 'admin';
-  }
-  const limiter = limiters[`${key}:${role}`] || limiters[`default:${role}`];
-  return limiter(req, res, next);
-}
+export function mcpRateLimiter(req: Request, res: any, next: any) {}
 

[Survived] ArithmeticOperator
src/middleware/rateLimit.ts:37:15
 limiters['default:admin'] = createRateLimiter(1000);
 
 export function mcpRateLimiter(req: Request, res: any, next: any) {
-  const key = req.baseUrl + req.path;
+  const key = req.baseUrl - req.path;
   // Defensive: req.user may be string, JwtPayload, or undefined
   let role = 'user';

[Killed] LogicalOperator
src/middleware/rateLimit.ts:40:7
   const key = req.baseUrl + req.path;
   // Defensive: req.user may be string, JwtPayload, or undefined
   let role = 'user';
-  if (typeof req.user === 'object' && req.user !== null && 'role' in req.user && req.user.role === 'admin') {
+  if (typeof req.user === 'object' && req.user !== null && 'role' in req.user || req.user.role === 'admin') {
     role = 'admin';
   }
killedBy: mcpRateLimiter should allow requests under the limit for /v1/mcp/tools/list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/middleware/rateLimit.ts:40:109
   const key = req.baseUrl + req.path;
   // Defensive: req.user may be string, JwtPayload, or undefined
   let role = 'user';
-  if (typeof req.user === 'object' && req.user !== null && 'role' in req.user && req.user.role === 'admin') {
-    role = 'admin';
-  }
+  if (typeof req.user === 'object' && req.user !== null && 'role' in req.user && req.user.role === 'admin') {}
   const limiter = limiters[`${key}:${role}`] || limiters[`default:${role}`];
   return limiter(req, res, next);
killedBy: mcpRateLimiter should allow higher limit for admin user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 429

[Killed] ConditionalExpression
src/middleware/rateLimit.ts:43:19
   if (typeof req.user === 'object' && req.user !== null && 'role' in req.user && req.user.role === 'admin') {
     role = 'admin';
   }
-  const limiter = limiters[`${key}:${role}`] || limiters[`default:${role}`];
+  const limiter = true;
   return limiter(req, res, next);
 }
killedBy: should use default admin limit for unknown endpoint with admin user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
src/middleware/rateLimit.ts:43:19
   if (typeof req.user === 'object' && req.user !== null && 'role' in req.user && req.user.role === 'admin') {
     role = 'admin';
   }
-  const limiter = limiters[`${key}:${role}`] || limiters[`default:${role}`];
+  const limiter = false;
   return limiter(req, res, next);
 }
killedBy: should use default admin limit for unknown endpoint with admin user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500
