[Timeout] BlockStatement
src/middleware/requestLogger.ts:4:80
 import { Request, Response, NextFunction } from 'express';
 import logger from '../utils/logger';
 
-export function requestLogger(req: Request, res: Response, next: NextFunction) {
-  const start = Date.now();
-  res.on('finish', () => {
-    logger.info({
-      method: req.method,
-      url: req.originalUrl,
-      status: res.statusCode,
-      duration: Date.now() - start,
-      user: (req as any).user?.sub || 'anon',
-      sessionId: (req as any).sessionId || null
-    }, 'Request completed');
-  });
-  next();
-}
+export function requestLogger(req: Request, res: Response, next: NextFunction) {}
 

[Killed] BlockStatement
src/middleware/requestLogger.ts:6:26
 
 export function requestLogger(req: Request, res: Response, next: NextFunction) {
   const start = Date.now();
-  res.on('finish', () => {
-    logger.info({
-      method: req.method,
-      url: req.originalUrl,
-      status: res.statusCode,
-      duration: Date.now() - start,
-      user: (req as any).user?.sub || 'anon',
-      sessionId: (req as any).sessionId || null
-    }, 'Request completed');
-  });
+  res.on('finish', () => {});
   next();
 }
killedBy: requestLogger middleware should log request info on finish
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"method": "GET", "sessionId": "sess", "status": 200, "url": "/test", "user": "user1"}, "Request completed"

Number of calls: 0

[Survived] ArithmeticOperator
src/middleware/requestLogger.ts:11:17
       method: req.method,
       url: req.originalUrl,
       status: res.statusCode,
-      duration: Date.now() - start,
+      duration: Date.now() + start,
       user: (req as any).user?.sub || 'anon',
       sessionId: (req as any).sessionId || null

[Killed] OptionalChaining
src/middleware/requestLogger.ts:12:13
       url: req.originalUrl,
       status: res.statusCode,
       duration: Date.now() - start,
-      user: (req as any).user?.sub || 'anon',
+      user: (req as any).user.sub || 'anon',
       sessionId: (req as any).sessionId || null
     }, 'Request completed');
killedBy: index.ts (Express app) should respond to /healthz
statusReason: TypeError: Cannot read properties of undefined (reading 'sub')

[Killed] ConditionalExpression
src/middleware/requestLogger.ts:12:13
       url: req.originalUrl,
       status: res.statusCode,
       duration: Date.now() - start,
-      user: (req as any).user?.sub || 'anon',
+      user: true,
       sessionId: (req as any).sessionId || null
     }, 'Request completed');
killedBy: requestLogger middleware should log request info on finish
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"method": "GET", "sessionId": "sess", "status": 200, "url": "/test", "user": "user1"}, "Request completed"
Received: {"duration": 0, "method": "GET", "sessionId": "sess", "status": 200, "url": "/test", "user": true}, "Request completed"

Number of calls: 1

[Killed] LogicalOperator
src/middleware/requestLogger.ts:13:18
       status: res.statusCode,
       duration: Date.now() - start,
       user: (req as any).user?.sub || 'anon',
-      sessionId: (req as any).sessionId || null
+      sessionId: (req as any).sessionId && null
     }, 'Request completed');
   });
killedBy: requestLogger middleware should log request info on finish
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"method": "GET", "sessionId": "sess", "status": 200, "url": "/test", "user": "user1"}, "Request completed"
Received: {"duration": 0, "method": "GET", "sessionId": null, "status": 200, "url": "/test", "user": "user1"}, "Request completed"

Number of calls: 1

[Killed] ConditionalExpression
src/middleware/requestLogger.ts:13:18
       status: res.statusCode,
       duration: Date.now() - start,
       user: (req as any).user?.sub || 'anon',
-      sessionId: (req as any).sessionId || null
+      sessionId: true
     }, 'Request completed');
   });
killedBy: requestLogger middleware should log request info on finish
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"method": "GET", "sessionId": "sess", "status": 200, "url": "/test", "user": "user1"}, "Request completed"
Received: {"duration": 0, "method": "GET", "sessionId": true, "status": 200, "url": "/test", "user": "user1"}, "Request completed"

Number of calls: 1

[Killed] StringLiteral
src/middleware/requestLogger.ts:14:8
       duration: Date.now() - start,
       user: (req as any).user?.sub || 'anon',
       sessionId: (req as any).sessionId || null
-    }, 'Request completed');
+    }, "");
   });
   next();
killedBy: requestLogger middleware should log request info on finish
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"method": "GET", "sessionId": "sess", "status": 200, "url": "/test", "user": "user1"}, "Request completed"
Received: {"duration": 0, "method": "GET", "sessionId": "sess", "status": 200, "url": "/test", "user": "user1"}, ""

Number of calls: 1
