[Timeout] BlockStatement
src/middleware/session.ts:4:84
 import { Request, Response, NextFunction } from 'express';
 import { v4 as uuidv4 } from 'uuid';
 
-export function sessionMiddleware(req: Request, res: Response, next: NextFunction) {
-  let sessionId = req.headers['x-session-id'] as string | undefined;
-  if (!sessionId) {
-    // Generate a secure, non-deterministic session ID
-    const userId = (req as any).user?.sub || 'anon';
-    sessionId = `${userId}:${uuidv4()}`;
-    res.setHeader('x-session-id', sessionId);
-  }
-  (req as any).sessionId = sessionId;
-  next();
-}
+export function sessionMiddleware(req: Request, res: Response, next: NextFunction) {}
 

[Killed] BlockStatement
src/middleware/session.ts:6:19
 
 export function sessionMiddleware(req: Request, res: Response, next: NextFunction) {
   let sessionId = req.headers['x-session-id'] as string | undefined;
-  if (!sessionId) {
-    // Generate a secure, non-deterministic session ID
-    const userId = (req as any).user?.sub || 'anon';
-    sessionId = `${userId}:${uuidv4()}`;
-    res.setHeader('x-session-id', sessionId);
-  }
+  if (!sessionId) {}
   (req as any).sessionId = sessionId;
   next();
killedBy: sessionMiddleware generates sessionId if header is missing and user is present
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] ConditionalExpression
src/middleware/session.ts:6:7
 
 export function sessionMiddleware(req: Request, res: Response, next: NextFunction) {
   let sessionId = req.headers['x-session-id'] as string | undefined;
-  if (!sessionId) {
+  if (true) {
     // Generate a secure, non-deterministic session ID
     const userId = (req as any).user?.sub || 'anon';
killedBy: sessionMiddleware sets sessionId from x-session-id header if present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user1:abc"
Received: "anon:ae2dfdab-5ab4-4794-b9a2-76488d6b1273"

[Killed] LogicalOperator
src/middleware/session.ts:8:20
   let sessionId = req.headers['x-session-id'] as string | undefined;
   if (!sessionId) {
     // Generate a secure, non-deterministic session ID
-    const userId = (req as any).user?.sub || 'anon';
+    const userId = (req as any).user?.sub && 'anon';
     sessionId = `${userId}:${uuidv4()}`;
     res.setHeader('x-session-id', sessionId);
killedBy: sessionMiddleware generates sessionId if header is missing and user is present
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^user2:/
Received string:  "anon:03ab6898-5ede-4bb0-9533-6fec8e0451b0"

[Killed] OptionalChaining
src/middleware/session.ts:8:20
   let sessionId = req.headers['x-session-id'] as string | undefined;
   if (!sessionId) {
     // Generate a secure, non-deterministic session ID
-    const userId = (req as any).user?.sub || 'anon';
+    const userId = (req as any).user.sub || 'anon';
     sessionId = `${userId}:${uuidv4()}`;
     res.setHeader('x-session-id', sessionId);
killedBy: index.ts (Express app) middleware and error handler coverage should 404 for unknown route (auth bypassed)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] StringLiteral
src/middleware/session.ts:10:19
     // Generate a secure, non-deterministic session ID
     const userId = (req as any).user?.sub || 'anon';
     sessionId = `${userId}:${uuidv4()}`;
-    res.setHeader('x-session-id', sessionId);
+    res.setHeader("", sessionId);
   }
   (req as any).sessionId = sessionId;
killedBy: sessionMiddleware generates sessionId if header is missing and user is present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "x-session-id", StringMatching /^user2:/
Received: "", "user2:e4728cfe-d1ab-4f22-824e-17b55edffbab"

Number of calls: 1
