[Killed] BlockStatement
src/middleware/validate.ts:3:43
 import { Request, Response, NextFunction } from 'express';
 
-export function validateBody(schema: any) {
-  return (req: Request, res: Response, next: NextFunction) => {
-    const result = schema.safeParse(req.body);
-    if (!result.success) {
-      return res.status(400).json({ error: 'Invalid request body', details: result.error.errors });
-    }
-    req.body = result.data;
-    next();
-  };
-}
+export function validateBody(schema: any) {}
 
killedBy: validateBody middleware calls next() and attaches parsed data for valid body
statusReason: TypeError: (0 , validate_1.validateBody)(...) is not a function

[Killed] BlockStatement
src/middleware/validate.ts:4:63
 import { Request, Response, NextFunction } from 'express';
 
 export function validateBody(schema: any) {
-  return (req: Request, res: Response, next: NextFunction) => {
-    const result = schema.safeParse(req.body);
-    if (!result.success) {
-      return res.status(400).json({ error: 'Invalid request body', details: result.error.errors });
-    }
-    req.body = result.data;
-    next();
-  };
+  return (req: Request, res: Response, next: NextFunction) => {};
 }
 
killedBy: validateBody middleware calls next() and attaches parsed data for valid body
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/middleware/validate.ts:6:9
 export function validateBody(schema: any) {
   return (req: Request, res: Response, next: NextFunction) => {
     const result = schema.safeParse(req.body);
-    if (!result.success) {
+    if (false) {
       return res.status(400).json({ error: 'Invalid request body', details: result.error.errors });
     }
killedBy: validateBody middleware returns 400 and error details for invalid body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] ConditionalExpression
src/middleware/validate.ts:6:9
 export function validateBody(schema: any) {
   return (req: Request, res: Response, next: NextFunction) => {
     const result = schema.safeParse(req.body);
-    if (!result.success) {
+    if (true) {
       return res.status(400).json({ error: 'Invalid request body', details: result.error.errors });
     }
killedBy: validateBody middleware calls next() and attaches parsed data for valid body
statusReason: TypeError: Cannot read properties of undefined (reading 'errors')
