[Killed] ObjectLiteral
src/types/toolZodSchemas.ts:11:20
 
 // Export all schemas for use in validation middleware
 export const toolZodSchemas = mcpTools.reduce((acc, tool) => {
-  acc[tool.name] = {
-    input: tool.inputZod,
-    output: tool.outputZod,
-  };
+  acc[tool.name] = {};
   return acc;
 }, {} as Record<string, { input: any; output: any }>);
killedBy: toolZodSchemas should have input and output schemas for each tool
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "input"
Received path: []

Received value: {}
