[Killed] EqualityOperator
src/utils/jsonSchemaToZod.ts:10:18
  * Note: Cognitive complexity is high due to JSON Schema branching. Consider refactoring for maintainability if needed.
  */
 export function jsonSchemaToZod(schema: any): ZodTypeAny {
-  if (!schema || typeof schema !== 'object') return z.any();
+  if (!schema || typeof schema === 'object') return z.any();
 
   // Handle enum
killedBy: jsonSchemaToZod converts string schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:10:7
  * Note: Cognitive complexity is high due to JSON Schema branching. Consider refactoring for maintainability if needed.
  */
 export function jsonSchemaToZod(schema: any): ZodTypeAny {
-  if (!schema || typeof schema !== 'object') return z.any();
+  if (false) return z.any();
 
   // Handle enum
killedBy: index.ts (Express app) middleware and error handler coverage applies rate limiter when NODE_ENV is not test (functional)
statusReason: Error: socket hang up

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:13:7
   if (!schema || typeof schema !== 'object') return z.any();
 
   // Handle enum
-  if (Array.isArray(schema.enum) && schema.enum.length > 0) {
+  if (false) {
     if (schema.enum.every((v: any) => typeof v === 'string')) {
       // All string enum
killedBy: jsonSchemaToZod converts string enum schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/utils/jsonSchemaToZod.ts:13:37
   if (!schema || typeof schema !== 'object') return z.any();
 
   // Handle enum
-  if (Array.isArray(schema.enum) && schema.enum.length > 0) {
+  if (Array.isArray(schema.enum) && schema.enum.length <= 0) {
     if (schema.enum.every((v: any) => typeof v === 'string')) {
       // All string enum
killedBy: jsonSchemaToZod converts string enum schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/utils/jsonSchemaToZod.ts:14:9
 
   // Handle enum
   if (Array.isArray(schema.enum) && schema.enum.length > 0) {
-    if (schema.enum.every((v: any) => typeof v === 'string')) {
+    if (schema.enum.some((v: any) => typeof v === 'string')) {
       // All string enum
       return z.enum(schema.enum as [string, ...string[]]);
killedBy: jsonSchemaToZod converts mixed enum schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:14:39
 
   // Handle enum
   if (Array.isArray(schema.enum) && schema.enum.length > 0) {
-    if (schema.enum.every((v: any) => typeof v === 'string')) {
+    if (schema.enum.every((v: any) => true)) {
       // All string enum
       return z.enum(schema.enum as [string, ...string[]]);
killedBy: jsonSchemaToZod converts mixed enum schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/utils/jsonSchemaToZod.ts:17:12
     if (schema.enum.every((v: any) => typeof v === 'string')) {
       // All string enum
       return z.enum(schema.enum as [string, ...string[]]);
-    } else {
-      // Mixed/other types: use union of literals
-      return z.union(schema.enum.map((v: any) => z.literal(v)));
-    }
+    } else {}
   }
 
killedBy: jsonSchemaToZod converts mixed enum schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/utils/jsonSchemaToZod.ts:19:38
       return z.enum(schema.enum as [string, ...string[]]);
     } else {
       // Mixed/other types: use union of literals
-      return z.union(schema.enum.map((v: any) => z.literal(v)));
+      return z.union(schema.enum.map(() => undefined));
     }
   }
killedBy: jsonSchemaToZod converts mixed enum schema
statusReason: TypeError: Cannot read properties of undefined (reading '_parseSync')

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:24:7
   }
 
   // Handle const
-  if (schema.const !== undefined) {
+  if (false) {
     return z.literal(schema.const);
   }
killedBy: jsonSchemaToZod converts const schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/utils/jsonSchemaToZod.ts:24:7
   }
 
   // Handle const
-  if (schema.const !== undefined) {
+  if (schema.const === undefined) {
     return z.literal(schema.const);
   }
killedBy: jsonSchemaToZod edge cases handles string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:29:7
   }
 
   // Handle oneOf/anyOf
-  if (schema.oneOf ?? schema.anyOf) {
+  if (false) {
     const variants = (schema.oneOf ?? schema.anyOf).map((s: any) => jsonSchemaToZod(s));
     return z.union(variants);
killedBy: jsonSchemaToZod converts oneOf schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/utils/jsonSchemaToZod.ts:29:37
   }
 
   // Handle oneOf/anyOf
-  if (schema.oneOf ?? schema.anyOf) {
-    const variants = (schema.oneOf ?? schema.anyOf).map((s: any) => jsonSchemaToZod(s));
-    return z.union(variants);
-  }
+  if (schema.oneOf ?? schema.anyOf) {}
 
   // Handle nullability (type: [T, "null"] or nullable: true)
killedBy: jsonSchemaToZod converts oneOf schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/utils/jsonSchemaToZod.ts:30:23
 
   // Handle oneOf/anyOf
   if (schema.oneOf ?? schema.anyOf) {
-    const variants = (schema.oneOf ?? schema.anyOf).map((s: any) => jsonSchemaToZod(s));
+    const variants = (schema.oneOf && schema.anyOf).map((s: any) => jsonSchemaToZod(s));
     return z.union(variants);
   }
killedBy: jsonSchemaToZod converts oneOf schema
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/utils/jsonSchemaToZod.ts:30:57
 
   // Handle oneOf/anyOf
   if (schema.oneOf ?? schema.anyOf) {
-    const variants = (schema.oneOf ?? schema.anyOf).map((s: any) => jsonSchemaToZod(s));
+    const variants = (schema.oneOf ?? schema.anyOf).map(() => undefined);
     return z.union(variants);
   }
killedBy: jsonSchemaToZod converts oneOf schema
statusReason: TypeError: Cannot read properties of undefined (reading '_parseSync')

[Survived] BooleanLiteral
src/utils/jsonSchemaToZod.ts:36:20
 
   // Handle nullability (type: [T, "null"] or nullable: true)
   let type = schema.type;
-  let isNullable = false;
+  let isNullable = true;
   if (Array.isArray(type)) {
     if (type.includes('null')) {

[Killed] BlockStatement
src/utils/jsonSchemaToZod.ts:37:28
   // Handle nullability (type: [T, "null"] or nullable: true)
   let type = schema.type;
   let isNullable = false;
-  if (Array.isArray(type)) {
-    if (type.includes('null')) {
-      isNullable = true;
-      type = type.filter((t: string) => t !== 'null')[0];
-    }
-  } else if (schema.nullable === true) {
+  if (Array.isArray(type)) {} else if (schema.nullable === true) {
     isNullable = true;
   }
killedBy: jsonSchemaToZod edge cases handles nullable via type array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:37:7
   // Handle nullability (type: [T, "null"] or nullable: true)
   let type = schema.type;
   let isNullable = false;
-  if (Array.isArray(type)) {
+  if (false) {
     if (type.includes('null')) {
       isNullable = true;
killedBy: jsonSchemaToZod handles nullable via type array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:38:9
   let type = schema.type;
   let isNullable = false;
   if (Array.isArray(type)) {
-    if (type.includes('null')) {
+    if (false) {
       isNullable = true;
       type = type.filter((t: string) => t !== 'null')[0];
killedBy: jsonSchemaToZod handles nullable via type array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/utils/jsonSchemaToZod.ts:38:32
   let type = schema.type;
   let isNullable = false;
   if (Array.isArray(type)) {
-    if (type.includes('null')) {
-      isNullable = true;
-      type = type.filter((t: string) => t !== 'null')[0];
-    }
+    if (type.includes('null')) {}
   } else if (schema.nullable === true) {
     isNullable = true;
killedBy: jsonSchemaToZod handles nullable via type array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/utils/jsonSchemaToZod.ts:39:20
   let isNullable = false;
   if (Array.isArray(type)) {
     if (type.includes('null')) {
-      isNullable = true;
+      isNullable = false;
       type = type.filter((t: string) => t !== 'null')[0];
     }
killedBy: jsonSchemaToZod handles nullable via type array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/utils/jsonSchemaToZod.ts:40:41
   if (Array.isArray(type)) {
     if (type.includes('null')) {
       isNullable = true;
-      type = type.filter((t: string) => t !== 'null')[0];
+      type = type.filter((t: string) => t === 'null')[0];
     }
   } else if (schema.nullable === true) {
killedBy: jsonSchemaToZod handles nullable via type array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/utils/jsonSchemaToZod.ts:40:26
   if (Array.isArray(type)) {
     if (type.includes('null')) {
       isNullable = true;
-      type = type.filter((t: string) => t !== 'null')[0];
+      type = type.filter(() => undefined)[0];
     }
   } else if (schema.nullable === true) {
killedBy: jsonSchemaToZod handles nullable via type array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/utils/jsonSchemaToZod.ts:42:40
       isNullable = true;
       type = type.filter((t: string) => t !== 'null')[0];
     }
-  } else if (schema.nullable === true) {
-    isNullable = true;
-  }
+  } else if (schema.nullable === true) {}
 
   let base: ZodTypeAny;
killedBy: jsonSchemaToZod handles nullable via nullable: true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/utils/jsonSchemaToZod.ts:42:34
       isNullable = true;
       type = type.filter((t: string) => t !== 'null')[0];
     }
-  } else if (schema.nullable === true) {
+  } else if (schema.nullable === false) {
     isNullable = true;
   }
killedBy: jsonSchemaToZod handles nullable via nullable: true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/utils/jsonSchemaToZod.ts:43:18
       type = type.filter((t: string) => t !== 'null')[0];
     }
   } else if (schema.nullable === true) {
-    isNullable = true;
+    isNullable = false;
   }
 
killedBy: jsonSchemaToZod handles nullable via nullable: true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:47:7
   }
 
   let base: ZodTypeAny;
-  if (type === 'string') {
+  if (true) {
     let str = z.string();
     if (schema.minLength !== undefined) str = str.min(schema.minLength);
killedBy: jsonSchemaToZod converts number schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:47:7
   }
 
   let base: ZodTypeAny;
-  if (type === 'string') {
+  if (false) {
     let str = z.string();
     if (schema.minLength !== undefined) str = str.min(schema.minLength);
killedBy: jsonSchemaToZod converts string schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/utils/jsonSchemaToZod.ts:49:9
   let base: ZodTypeAny;
   if (type === 'string') {
     let str = z.string();
-    if (schema.minLength !== undefined) str = str.min(schema.minLength);
+    if (schema.minLength === undefined) str = str.min(schema.minLength);
     if (schema.maxLength !== undefined) str = str.max(schema.maxLength);
     if (schema.pattern) str = str.regex(new RegExp(schema.pattern));
killedBy: jsonSchemaToZod converts string schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:49:9
   let base: ZodTypeAny;
   if (type === 'string') {
     let str = z.string();
-    if (schema.minLength !== undefined) str = str.min(schema.minLength);
+    if (false) str = str.min(schema.minLength);
     if (schema.maxLength !== undefined) str = str.max(schema.maxLength);
     if (schema.pattern) str = str.regex(new RegExp(schema.pattern));
killedBy: jsonSchemaToZod converts string schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/utils/jsonSchemaToZod.ts:50:47
   if (type === 'string') {
     let str = z.string();
     if (schema.minLength !== undefined) str = str.min(schema.minLength);
-    if (schema.maxLength !== undefined) str = str.max(schema.maxLength);
+    if (schema.maxLength !== undefined) str = str.min(schema.maxLength);
     if (schema.pattern) str = str.regex(new RegExp(schema.pattern));
     base = str;
killedBy: jsonSchemaToZod converts string schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/utils/jsonSchemaToZod.ts:50:9
   if (type === 'string') {
     let str = z.string();
     if (schema.minLength !== undefined) str = str.min(schema.minLength);
-    if (schema.maxLength !== undefined) str = str.max(schema.maxLength);
+    if (schema.maxLength === undefined) str = str.max(schema.maxLength);
     if (schema.pattern) str = str.regex(new RegExp(schema.pattern));
     base = str;
killedBy: jsonSchemaToZod converts string schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:51:9
     let str = z.string();
     if (schema.minLength !== undefined) str = str.min(schema.minLength);
     if (schema.maxLength !== undefined) str = str.max(schema.maxLength);
-    if (schema.pattern) str = str.regex(new RegExp(schema.pattern));
+    if (false) str = str.regex(new RegExp(schema.pattern));
     base = str;
   } else if (type === 'number' || type === 'integer') {
killedBy: jsonSchemaToZod edge cases handles string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ConditionalExpression
src/utils/jsonSchemaToZod.ts:51:9
     let str = z.string();
     if (schema.minLength !== undefined) str = str.min(schema.minLength);
     if (schema.maxLength !== undefined) str = str.max(schema.maxLength);
-    if (schema.pattern) str = str.regex(new RegExp(schema.pattern));
+    if (true) str = str.regex(new RegExp(schema.pattern));
     base = str;
   } else if (type === 'number' || type === 'integer') {

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:53:14
     if (schema.maxLength !== undefined) str = str.max(schema.maxLength);
     if (schema.pattern) str = str.regex(new RegExp(schema.pattern));
     base = str;
-  } else if (type === 'number' || type === 'integer') {
+  } else if (false) {
     let num = z.number();
     if (schema.minimum !== undefined) num = num.min(schema.minimum);
killedBy: jsonSchemaToZod converts number schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:53:14
     if (schema.maxLength !== undefined) str = str.max(schema.maxLength);
     if (schema.pattern) str = str.regex(new RegExp(schema.pattern));
     base = str;
-  } else if (type === 'number' || type === 'integer') {
+  } else if (false || type === 'integer') {
     let num = z.number();
     if (schema.minimum !== undefined) num = num.min(schema.minimum);
killedBy: jsonSchemaToZod converts number schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/utils/jsonSchemaToZod.ts:55:9
     base = str;
   } else if (type === 'number' || type === 'integer') {
     let num = z.number();
-    if (schema.minimum !== undefined) num = num.min(schema.minimum);
+    if (schema.minimum === undefined) num = num.min(schema.minimum);
     if (schema.maximum !== undefined) num = num.max(schema.maximum);
     if (type === 'integer') num = num.int(); // Enforce integer if type is 'integer'
killedBy: jsonSchemaToZod edge cases handles minimum and maximum for number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:55:9
     base = str;
   } else if (type === 'number' || type === 'integer') {
     let num = z.number();
-    if (schema.minimum !== undefined) num = num.min(schema.minimum);
+    if (false) num = num.min(schema.minimum);
     if (schema.maximum !== undefined) num = num.max(schema.maximum);
     if (type === 'integer') num = num.int(); // Enforce integer if type is 'integer'
killedBy: jsonSchemaToZod edge cases handles minimum and maximum for number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:56:9
   } else if (type === 'number' || type === 'integer') {
     let num = z.number();
     if (schema.minimum !== undefined) num = num.min(schema.minimum);
-    if (schema.maximum !== undefined) num = num.max(schema.maximum);
+    if (false) num = num.max(schema.maximum);
     if (type === 'integer') num = num.int(); // Enforce integer if type is 'integer'
     base = num;
killedBy: jsonSchemaToZod converts number schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/utils/jsonSchemaToZod.ts:56:45
   } else if (type === 'number' || type === 'integer') {
     let num = z.number();
     if (schema.minimum !== undefined) num = num.min(schema.minimum);
-    if (schema.maximum !== undefined) num = num.max(schema.maximum);
+    if (schema.maximum !== undefined) num = num.min(schema.maximum);
     if (type === 'integer') num = num.int(); // Enforce integer if type is 'integer'
     base = num;
killedBy: jsonSchemaToZod converts number schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:57:9
     let num = z.number();
     if (schema.minimum !== undefined) num = num.min(schema.minimum);
     if (schema.maximum !== undefined) num = num.max(schema.maximum);
-    if (type === 'integer') num = num.int(); // Enforce integer if type is 'integer'
+    if (false) num = num.int(); // Enforce integer if type is 'integer'
     base = num;
   } else if (type === 'boolean') {
killedBy: jsonSchemaToZod converts integer schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/utils/jsonSchemaToZod.ts:57:9
     let num = z.number();
     if (schema.minimum !== undefined) num = num.min(schema.minimum);
     if (schema.maximum !== undefined) num = num.max(schema.maximum);
-    if (type === 'integer') num = num.int(); // Enforce integer if type is 'integer'
+    if (type !== 'integer') num = num.int(); // Enforce integer if type is 'integer'
     base = num;
   } else if (type === 'boolean') {
killedBy: jsonSchemaToZod converts integer schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:59:14
     if (schema.maximum !== undefined) num = num.max(schema.maximum);
     if (type === 'integer') num = num.int(); // Enforce integer if type is 'integer'
     base = num;
-  } else if (type === 'boolean') {
+  } else if (true) {
     base = z.boolean();
   } else if (type === 'array') {
killedBy: jsonSchemaToZod edge cases handles array with items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:59:14
     if (schema.maximum !== undefined) num = num.max(schema.maximum);
     if (type === 'integer') num = num.int(); // Enforce integer if type is 'integer'
     base = num;
-  } else if (type === 'boolean') {
+  } else if (false) {
     base = z.boolean();
   } else if (type === 'array') {
killedBy: jsonSchemaToZod converts anyOf schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:61:14
     base = num;
   } else if (type === 'boolean') {
     base = z.boolean();
-  } else if (type === 'array') {
+  } else if (true) {
     base = z.array(jsonSchemaToZod(schema.items));
   } else if (type === 'object') {
killedBy: jsonSchemaToZod converts object schema with required/optional
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/utils/jsonSchemaToZod.ts:61:32
     base = num;
   } else if (type === 'boolean') {
     base = z.boolean();
-  } else if (type === 'array') {
-    base = z.array(jsonSchemaToZod(schema.items));
-  } else if (type === 'object') {
+  } else if (type === 'array') {} else if (type === 'object') {
     if (!schema.properties) return z.record(z.any());
     const shape: Record<string, ZodTypeAny> = {};
killedBy: jsonSchemaToZod converts array schema
statusReason: TypeError: Cannot read properties of undefined (reading 'safeParse')

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:63:14
     base = z.boolean();
   } else if (type === 'array') {
     base = z.array(jsonSchemaToZod(schema.items));
-  } else if (type === 'object') {
+  } else if (false) {
     if (!schema.properties) return z.record(z.any());
     const shape: Record<string, ZodTypeAny> = {};
killedBy: jsonSchemaToZod converts object schema with required/optional
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/utils/jsonSchemaToZod.ts:63:14
     base = z.boolean();
   } else if (type === 'array') {
     base = z.array(jsonSchemaToZod(schema.items));
-  } else if (type === 'object') {
+  } else if (type !== 'object') {
     if (!schema.properties) return z.record(z.any());
     const shape: Record<string, ZodTypeAny> = {};
killedBy: jsonSchemaToZod converts object schema with required/optional
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:64:9
   } else if (type === 'array') {
     base = z.array(jsonSchemaToZod(schema.items));
   } else if (type === 'object') {
-    if (!schema.properties) return z.record(z.any());
+    if (false) return z.record(z.any());
     const shape: Record<string, ZodTypeAny> = {};
     // If required is missing, all properties are required by default (per JSON Schema spec)
killedBy: jsonSchemaToZod returns z.record(z.any()) if object schema has no properties
statusReason: TypeError: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:64:9
   } else if (type === 'array') {
     base = z.array(jsonSchemaToZod(schema.items));
   } else if (type === 'object') {
-    if (!schema.properties) return z.record(z.any());
+    if (true) return z.record(z.any());
     const shape: Record<string, ZodTypeAny> = {};
     // If required is missing, all properties are required by default (per JSON Schema spec)
killedBy: jsonSchemaToZod converts object schema with required/optional
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/utils/jsonSchemaToZod.ts:67:32
     if (!schema.properties) return z.record(z.any());
     const shape: Record<string, ZodTypeAny> = {};
     // If required is missing, all properties are required by default (per JSON Schema spec)
-    const required: string[] = schema.required ?? Object.keys(schema.properties);
+    const required: string[] = schema.required && Object.keys(schema.properties);
     for (const [key, propSchema] of Object.entries(schema.properties)) {
       let prop = jsonSchemaToZod(propSchema);
killedBy: jsonSchemaToZod converts object schema with required/optional
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/utils/jsonSchemaToZod.ts:68:72
     const shape: Record<string, ZodTypeAny> = {};
     // If required is missing, all properties are required by default (per JSON Schema spec)
     const required: string[] = schema.required ?? Object.keys(schema.properties);
-    for (const [key, propSchema] of Object.entries(schema.properties)) {
-      let prop = jsonSchemaToZod(propSchema);
-      if (!required.includes(key)) {
-        prop = prop.optional();
-      }
-      shape[key] = prop;
-    }
+    for (const [key, propSchema] of Object.entries(schema.properties)) {}
     base = z.object(shape);
   } else {
killedBy: jsonSchemaToZod converts object schema with required/optional
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/utils/jsonSchemaToZod.ts:70:11
     const required: string[] = schema.required ?? Object.keys(schema.properties);
     for (const [key, propSchema] of Object.entries(schema.properties)) {
       let prop = jsonSchemaToZod(propSchema);
-      if (!required.includes(key)) {
+      if (required.includes(key)) {
         prop = prop.optional();
       }
killedBy: jsonSchemaToZod converts object schema with required/optional
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/utils/jsonSchemaToZod.ts:70:36
     const required: string[] = schema.required ?? Object.keys(schema.properties);
     for (const [key, propSchema] of Object.entries(schema.properties)) {
       let prop = jsonSchemaToZod(propSchema);
-      if (!required.includes(key)) {
-        prop = prop.optional();
-      }
+      if (!required.includes(key)) {}
       shape[key] = prop;
     }
killedBy: jsonSchemaToZod converts object schema with required/optional
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/utils/jsonSchemaToZod.ts:76:10
       shape[key] = prop;
     }
     base = z.object(shape);
-  } else {
-    base = z.any();
-  }
+  } else {}
 
   if (isNullable) {
killedBy: jsonSchemaToZod falls back to z.any for unknown type
statusReason: TypeError: Cannot read properties of undefined (reading 'safeParse')

[Killed] ConditionalExpression
src/utils/jsonSchemaToZod.ts:80:7
     base = z.any();
   }
 
-  if (isNullable) {
+  if (false) {
     return base.nullable();
   }
killedBy: jsonSchemaToZod handles nullable via type array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/utils/jsonSchemaToZod.ts:80:19
     base = z.any();
   }
 
-  if (isNullable) {
-    return base.nullable();
-  }
+  if (isNullable) {}
   return base;
 }
killedBy: jsonSchemaToZod handles nullable via type array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
