[Survived] BlockStatement
src/utils/logger.ts:7:29
 import path from 'path';
 
 const logDir = process.env.LOG_DIR || 'logs';
-if (!fs.existsSync(logDir)) {
-  fs.mkdirSync(logDir);
-}
+if (!fs.existsSync(logDir)) {}
 
 const logger = pino({

[Survived] ConditionalExpression
src/utils/logger.ts:7:5
 import path from 'path';
 
 const logDir = process.env.LOG_DIR || 'logs';
-if (!fs.existsSync(logDir)) {
+if (false) {
   fs.mkdirSync(logDir);
 }

[Survived] ConditionalExpression
src/utils/logger.ts:13:14
 
 const logger = pino({
   level: process.env.LOG_LEVEL || 'info',
-  transport: process.env.NODE_ENV === 'development' ? {
+  transport: true ? {
     target: 'pino-pretty',
     options: { colorize: true }

[Survived] ConditionalExpression
src/utils/logger.ts:13:14
 
 const logger = pino({
   level: process.env.LOG_LEVEL || 'info',
-  transport: process.env.NODE_ENV === 'development' ? {
+  transport: false ? {
     target: 'pino-pretty',
     options: { colorize: true }

[Survived] StringLiteral
src/utils/logger.ts:14:13
 const logger = pino({
   level: process.env.LOG_LEVEL || 'info',
   transport: process.env.NODE_ENV === 'development' ? {
-    target: 'pino-pretty',
+    target: "",
     options: { colorize: true }
   } : undefined

[Survived] BooleanLiteral
src/utils/logger.ts:15:26
   level: process.env.LOG_LEVEL || 'info',
   transport: process.env.NODE_ENV === 'development' ? {
     target: 'pino-pretty',
-    options: { colorize: true }
+    options: { colorize: false }
   } : undefined
 },

[Survived] ObjectLiteral
src/utils/logger.ts:15:14
   level: process.env.LOG_LEVEL || 'info',
   transport: process.env.NODE_ENV === 'development' ? {
     target: 'pino-pretty',
-    options: { colorize: true }
+    options: {}
   } : undefined
 },

[Survived] ObjectLiteral
src/utils/logger.ts:18:20
     options: { colorize: true }
   } : undefined
 },
-  pino.destination({
-    dest: path.join(logDir, 'app.log'),
-    minLength: 4096,
-    sync: false
-  })
+  pino.destination({})
 );
 

[Survived] BooleanLiteral
src/utils/logger.ts:21:11
   pino.destination({
     dest: path.join(logDir, 'app.log'),
     minLength: 4096,
-    sync: false
+    sync: true
   })
 );

[Survived] ObjectLiteral
src/utils/logger.ts:25:36
   })
 );
 
-export const httpLogger = pinoHttp({ logger });
+export const httpLogger = pinoHttp({});
 export default logger;
 
