[Survived] BooleanLiteral
src/utils/observability.ts:8:56
 import { PrometheusExporter } from '@opentelemetry/exporter-prometheus';
 
 const sdk = new NodeSDK({
-  traceExporter: new PrometheusExporter({ startServer: true, port: 9464 }),
+  traceExporter: new PrometheusExporter({ startServer: false, port: 9464 }),
   instrumentations: [getNodeAutoInstrumentations(), new ExpressInstrumentation()]
 });

[Timeout] BlockStatement
src/utils/observability.ts:22:51
   labelNames: ['method', 'route', 'status']
 });
 
-export function metricsMiddleware(req, res, next) {
-  res.on('finish', () => {
-    httpRequestCounter.inc({
-      method: req.method,
-      route: req.route ? req.route.path : req.path,
-      status: res.statusCode
-    });
-  });
-  next();
-}
+export function metricsMiddleware(req, res, next) {}
 
 export function exposePrometheusMetrics(app) {

[Killed] BlockStatement
src/utils/observability.ts:23:26
 });
 
 export function metricsMiddleware(req, res, next) {
-  res.on('finish', () => {
-    httpRequestCounter.inc({
-      method: req.method,
-      route: req.route ? req.route.path : req.path,
-      status: res.statusCode
-    });
-  });
+  res.on('finish', () => {});
   next();
 }
killedBy: observability should increment httpRequestCounter on request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/utils/observability.ts:33:46
   next();
 }
 
-export function exposePrometheusMetrics(app) {
-  app.get('/metrics', async (_req, res) => {
-    res.set('Content-Type', client.register.contentType);
-    res.end(await client.register.metrics());
-  });
-}
+export function exposePrometheusMetrics(app) {}
 
killedBy: observability should increment httpRequestCounter on request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Timeout] BlockStatement
src/utils/observability.ts:34:44
 }
 
 export function exposePrometheusMetrics(app) {
-  app.get('/metrics', async (_req, res) => {
-    res.set('Content-Type', client.register.contentType);
-    res.end(await client.register.metrics());
-  });
+  app.get('/metrics', async (_req, res) => {});
 }
 
