[Survived] StringLiteral
src/utils/openapi-to-mcp.ts:11:41
  */
 export function loadOpenApiSpec(openapiPath: string) {
   const fullPath = path.resolve(openapiPath);
-  const raw = fs.readFileSync(fullPath, 'utf-8');
+  const raw = fs.readFileSync(fullPath, "");
   return JSON.parse(raw);
 }

[Killed] BlockStatement
src/utils/openapi-to-mcp.ts:19:83
  * Converts a JSON Schema object to a TypeScript type definition string.
  * This is a basic implementation for demonstration; for production use, consider a library like json-schema-to-typescript.
  */
-export function jsonSchemaToTypeScriptType(schema: any, typeName: string): string {
-  if (!schema || typeof schema !== 'object') return `type ${typeName} = any;`;
-  if (schema.type === 'object' && schema.properties) {
-    const props = Object.entries(schema.properties)
-      .map(([key, val]: [string, any]) => {
-        const optional = schema.required && !schema.required.includes(key) ? '?' : '';
-        return `  ${key}${optional}: ${jsonSchemaTypeToTs(val)};`;
-      })
-      .join('\n');
-    return `export interface ${typeName} {\n${props}\n}`;
-  }
-  if (schema.type === 'array') {
-    return `type ${typeName} = ${jsonSchemaTypeToTs(schema.items)}[];`;
-  }
-  return `type ${typeName} = any;`;
-}
+export function jsonSchemaToTypeScriptType(schema: any, typeName: string): string {}
 
 export function jsonSchemaTypeToTs(schema: any): string {
killedBy: OpenAPI to MCP Tool Mapping should generate valid TypeScript types for tool input/output
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: "undefined"

[Killed] ConditionalExpression
src/utils/openapi-to-mcp.ts:20:7
  * This is a basic implementation for demonstration; for production use, consider a library like json-schema-to-typescript.
  */
 export function jsonSchemaToTypeScriptType(schema: any, typeName: string): string {
-  if (!schema || typeof schema !== 'object') return `type ${typeName} = any;`;
+  if (false) return `type ${typeName} = any;`;
   if (schema.type === 'object' && schema.properties) {
     const props = Object.entries(schema.properties)
killedBy: jsonSchemaToTypeScriptType returns any type for undefined or non-object schema
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
src/utils/openapi-to-mcp.ts:20:7
  * This is a basic implementation for demonstration; for production use, consider a library like json-schema-to-typescript.
  */
 export function jsonSchemaToTypeScriptType(schema: any, typeName: string): string {
-  if (!schema || typeof schema !== 'object') return `type ${typeName} = any;`;
+  if (true) return `type ${typeName} = any;`;
   if (schema.type === 'object' && schema.properties) {
     const props = Object.entries(schema.properties)
killedBy: jsonSchemaToTypeScriptType should return interface for object schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "export interface TestType"
Received string:    "type TestType = any;"

[Killed] EqualityOperator
src/utils/openapi-to-mcp.ts:21:7
  */
 export function jsonSchemaToTypeScriptType(schema: any, typeName: string): string {
   if (!schema || typeof schema !== 'object') return `type ${typeName} = any;`;
-  if (schema.type === 'object' && schema.properties) {
+  if (schema.type !== 'object' && schema.properties) {
     const props = Object.entries(schema.properties)
       .map(([key, val]: [string, any]) => {
killedBy: jsonSchemaToTypeScriptType should return interface for object schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "export interface TestType"
Received string:    "type TestType = any;"

[Killed] ConditionalExpression
src/utils/openapi-to-mcp.ts:21:7
  */
 export function jsonSchemaToTypeScriptType(schema: any, typeName: string): string {
   if (!schema || typeof schema !== 'object') return `type ${typeName} = any;`;
-  if (schema.type === 'object' && schema.properties) {
+  if (false) {
     const props = Object.entries(schema.properties)
       .map(([key, val]: [string, any]) => {
killedBy: jsonSchemaToTypeScriptType should return interface for object schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "export interface TestType"
Received string:    "type TestType = any;"

[Killed] BlockStatement
src/utils/openapi-to-mcp.ts:23:43
   if (!schema || typeof schema !== 'object') return `type ${typeName} = any;`;
   if (schema.type === 'object' && schema.properties) {
     const props = Object.entries(schema.properties)
-      .map(([key, val]: [string, any]) => {
-        const optional = schema.required && !schema.required.includes(key) ? '?' : '';
-        return `  ${key}${optional}: ${jsonSchemaTypeToTs(val)};`;
-      })
+      .map(([key, val]: [string, any]) => {})
       .join('\n');
     return `export interface ${typeName} {\n${props}\n}`;
killedBy: jsonSchemaToTypeScriptType should return interface for object schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "foo: string;"
Received string:    "export interface TestType {·
}"

[Killed] ConditionalExpression
src/utils/openapi-to-mcp.ts:24:26
   if (schema.type === 'object' && schema.properties) {
     const props = Object.entries(schema.properties)
       .map(([key, val]: [string, any]) => {
-        const optional = schema.required && !schema.required.includes(key) ? '?' : '';
+        const optional = true ? '?' : '';
         return `  ${key}${optional}: ${jsonSchemaTypeToTs(val)};`;
       })
killedBy: jsonSchemaToTypeScriptType should return interface for object schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "foo: string;"
Received string:    "export interface TestType {
  foo?: string;
}"

[Killed] LogicalOperator
src/utils/openapi-to-mcp.ts:24:26
   if (schema.type === 'object' && schema.properties) {
     const props = Object.entries(schema.properties)
       .map(([key, val]: [string, any]) => {
-        const optional = schema.required && !schema.required.includes(key) ? '?' : '';
+        const optional = schema.required || !schema.required.includes(key) ? '?' : '';
         return `  ${key}${optional}: ${jsonSchemaTypeToTs(val)};`;
       })
killedBy: jsonSchemaToTypeScriptType should return interface for object schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "foo: string;"
Received string:    "export interface TestType {
  foo?: string;
}"

[Killed] StringLiteral
src/utils/openapi-to-mcp.ts:25:16
     const props = Object.entries(schema.properties)
       .map(([key, val]: [string, any]) => {
         const optional = schema.required && !schema.required.includes(key) ? '?' : '';
-        return `  ${key}${optional}: ${jsonSchemaTypeToTs(val)};`;
+        return ``;
       })
       .join('\n');
killedBy: jsonSchemaToTypeScriptType should return interface for object schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "foo: string;"
Received string:    "export interface TestType {·
}"

[Killed] EqualityOperator
src/utils/openapi-to-mcp.ts:30:7
       .join('\n');
     return `export interface ${typeName} {\n${props}\n}`;
   }
-  if (schema.type === 'array') {
+  if (schema.type !== 'array') {
     return `type ${typeName} = ${jsonSchemaTypeToTs(schema.items)}[];`;
   }
killedBy: jsonSchemaToTypeScriptType should return array type for array schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "TestArr = number[]"
Received string:    "type TestArr = any;"

[Killed] BlockStatement
src/utils/openapi-to-mcp.ts:30:32
       .join('\n');
     return `export interface ${typeName} {\n${props}\n}`;
   }
-  if (schema.type === 'array') {
-    return `type ${typeName} = ${jsonSchemaTypeToTs(schema.items)}[];`;
-  }
+  if (schema.type === 'array') {}
   return `type ${typeName} = any;`;
 }
killedBy: jsonSchemaToTypeScriptType handles array schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "string[]"
Received string:    "type MyArray = any;"

[Killed] BlockStatement
src/utils/openapi-to-mcp.ts:36:57
   return `type ${typeName} = any;`;
 }
 
-export function jsonSchemaTypeToTs(schema: any): string {
-  if (!schema) return 'any';
-  if (schema.type === 'string') return 'string';
-  if (schema.type === 'number' || schema.type === 'integer') return 'number';
-  if (schema.type === 'boolean') return 'boolean';
-  if (schema.type === 'array') return `${jsonSchemaTypeToTs(schema.items)}[]`;
-  if (schema.type === 'object' && schema.properties) {
-    return `{ ${Object.entries(schema.properties)
-      .map(([k, v]: [string, any]) => `${k}: ${jsonSchemaTypeToTs(v)}`)
-      .join('; ')} }`;
-  }
-  return 'any';
-}
+export function jsonSchemaTypeToTs(schema: any): string {}
 
 /**
killedBy: jsonSchemaToTypeScriptType handles array schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "string[]"
Received string:    "type MyArray = undefined[];"

[Killed] BooleanLiteral
src/utils/openapi-to-mcp.ts:37:7
 }
 
 export function jsonSchemaTypeToTs(schema: any): string {
-  if (!schema) return 'any';
+  if (schema) return 'any';
   if (schema.type === 'string') return 'string';
   if (schema.type === 'number' || schema.type === 'integer') return 'number';
killedBy: jsonSchemaToTypeScriptType handles array schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "string[]"
Received string:    "type MyArray = any[];"

[Killed] ConditionalExpression
src/utils/openapi-to-mcp.ts:37:7
 }
 
 export function jsonSchemaTypeToTs(schema: any): string {
-  if (!schema) return 'any';
+  if (false) return 'any';
   if (schema.type === 'string') return 'string';
   if (schema.type === 'number' || schema.type === 'integer') return 'number';
killedBy: jsonSchemaTypeToTs returns any for unknown or missing schema
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
src/utils/openapi-to-mcp.ts:38:7
 
 export function jsonSchemaTypeToTs(schema: any): string {
   if (!schema) return 'any';
-  if (schema.type === 'string') return 'string';
+  if (true) return 'string';
   if (schema.type === 'number' || schema.type === 'integer') return 'number';
   if (schema.type === 'boolean') return 'boolean';
killedBy: jsonSchemaToTypeScriptType handles object with properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "number"
Received string:    "export interface MyObj {
  foo: string;
  bar?: string;
}"

[Killed] EqualityOperator
src/utils/openapi-to-mcp.ts:38:7
 
 export function jsonSchemaTypeToTs(schema: any): string {
   if (!schema) return 'any';
-  if (schema.type === 'string') return 'string';
+  if (schema.type !== 'string') return 'string';
   if (schema.type === 'number' || schema.type === 'integer') return 'number';
   if (schema.type === 'boolean') return 'boolean';
killedBy: jsonSchemaToTypeScriptType handles array schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "string[]"
Received string:    "type MyArray = any[];"

[Killed] EqualityOperator
src/utils/openapi-to-mcp.ts:39:7
 export function jsonSchemaTypeToTs(schema: any): string {
   if (!schema) return 'any';
   if (schema.type === 'string') return 'string';
-  if (schema.type === 'number' || schema.type === 'integer') return 'number';
+  if (schema.type !== 'number' || schema.type === 'integer') return 'number';
   if (schema.type === 'boolean') return 'boolean';
   if (schema.type === 'array') return `${jsonSchemaTypeToTs(schema.items)}[]`;
killedBy: jsonSchemaToTypeScriptType handles object with properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "number"
Received string:    "export interface MyObj {
  foo: string;
  bar?: any;
}"

[Killed] EqualityOperator
src/utils/openapi-to-mcp.ts:39:35
 export function jsonSchemaTypeToTs(schema: any): string {
   if (!schema) return 'any';
   if (schema.type === 'string') return 'string';
-  if (schema.type === 'number' || schema.type === 'integer') return 'number';
+  if (schema.type === 'number' || schema.type !== 'integer') return 'number';
   if (schema.type === 'boolean') return 'boolean';
   if (schema.type === 'array') return `${jsonSchemaTypeToTs(schema.items)}[]`;
killedBy: jsonSchemaTypeToTs returns number for number/integer schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "number"
Received: "any"

[Killed] EqualityOperator
src/utils/openapi-to-mcp.ts:40:7
   if (!schema) return 'any';
   if (schema.type === 'string') return 'string';
   if (schema.type === 'number' || schema.type === 'integer') return 'number';
-  if (schema.type === 'boolean') return 'boolean';
+  if (schema.type !== 'boolean') return 'boolean';
   if (schema.type === 'array') return `${jsonSchemaTypeToTs(schema.items)}[]`;
   if (schema.type === 'object' && schema.properties) {
killedBy: jsonSchemaTypeToTs returns boolean for boolean schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "boolean"
Received: "any"

[Killed] ConditionalExpression
src/utils/openapi-to-mcp.ts:40:7
   if (!schema) return 'any';
   if (schema.type === 'string') return 'string';
   if (schema.type === 'number' || schema.type === 'integer') return 'number';
-  if (schema.type === 'boolean') return 'boolean';
+  if (false) return 'boolean';
   if (schema.type === 'array') return `${jsonSchemaTypeToTs(schema.items)}[]`;
   if (schema.type === 'object' && schema.properties) {
killedBy: jsonSchemaTypeToTs returns boolean for boolean schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "boolean"
Received: "any"

[Killed] ConditionalExpression
src/utils/openapi-to-mcp.ts:41:7
   if (schema.type === 'string') return 'string';
   if (schema.type === 'number' || schema.type === 'integer') return 'number';
   if (schema.type === 'boolean') return 'boolean';
-  if (schema.type === 'array') return `${jsonSchemaTypeToTs(schema.items)}[]`;
+  if (false) return `${jsonSchemaTypeToTs(schema.items)}[]`;
   if (schema.type === 'object' && schema.properties) {
     return `{ ${Object.entries(schema.properties)
killedBy: jsonSchemaTypeToTs returns array type for array schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string[]"
Received: "any"

[Killed] EqualityOperator
src/utils/openapi-to-mcp.ts:41:7
   if (schema.type === 'string') return 'string';
   if (schema.type === 'number' || schema.type === 'integer') return 'number';
   if (schema.type === 'boolean') return 'boolean';
-  if (schema.type === 'array') return `${jsonSchemaTypeToTs(schema.items)}[]`;
+  if (schema.type !== 'array') return `${jsonSchemaTypeToTs(schema.items)}[]`;
   if (schema.type === 'object' && schema.properties) {
     return `{ ${Object.entries(schema.properties)
killedBy: jsonSchemaTypeToTs returns array type for array schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string[]"
Received: "any"

[Killed] BlockStatement
src/utils/openapi-to-mcp.ts:42:54
   if (schema.type === 'number' || schema.type === 'integer') return 'number';
   if (schema.type === 'boolean') return 'boolean';
   if (schema.type === 'array') return `${jsonSchemaTypeToTs(schema.items)}[]`;
-  if (schema.type === 'object' && schema.properties) {
-    return `{ ${Object.entries(schema.properties)
-      .map(([k, v]: [string, any]) => `${k}: ${jsonSchemaTypeToTs(v)}`)
-      .join('; ')} }`;
-  }
+  if (schema.type === 'object' && schema.properties) {}
   return 'any';
 }
killedBy: jsonSchemaTypeToTs returns object type for object schema with properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ foo: string; bar: number }"
Received: "any"

[Killed] ConditionalExpression
src/utils/openapi-to-mcp.ts:42:7
   if (schema.type === 'number' || schema.type === 'integer') return 'number';
   if (schema.type === 'boolean') return 'boolean';
   if (schema.type === 'array') return `${jsonSchemaTypeToTs(schema.items)}[]`;
-  if (schema.type === 'object' && schema.properties) {
+  if (false) {
     return `{ ${Object.entries(schema.properties)
       .map(([k, v]: [string, any]) => `${k}: ${jsonSchemaTypeToTs(v)}`)
killedBy: jsonSchemaTypeToTs returns object type for object schema with properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ foo: string; bar: number }"
Received: "any"

[Killed] StringLiteral
src/utils/openapi-to-mcp.ts:43:12
   if (schema.type === 'boolean') return 'boolean';
   if (schema.type === 'array') return `${jsonSchemaTypeToTs(schema.items)}[]`;
   if (schema.type === 'object' && schema.properties) {
-    return `{ ${Object.entries(schema.properties)
-      .map(([k, v]: [string, any]) => `${k}: ${jsonSchemaTypeToTs(v)}`)
-      .join('; ')} }`;
+    return ``;
   }
   return 'any';
killedBy: jsonSchemaTypeToTs returns object type for object schema with properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ foo: string; bar: number }"
Received: ""

[Killed] ArrowFunction
src/utils/openapi-to-mcp.ts:44:12
   if (schema.type === 'array') return `${jsonSchemaTypeToTs(schema.items)}[]`;
   if (schema.type === 'object' && schema.properties) {
     return `{ ${Object.entries(schema.properties)
-      .map(([k, v]: [string, any]) => `${k}: ${jsonSchemaTypeToTs(v)}`)
+      .map(() => undefined)
       .join('; ')} }`;
   }
killedBy: jsonSchemaTypeToTs returns object type for object schema with properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ foo: string; bar: number }"
Received: "{ ;  }"

[Killed] StringLiteral
src/utils/openapi-to-mcp.ts:44:39
   if (schema.type === 'array') return `${jsonSchemaTypeToTs(schema.items)}[]`;
   if (schema.type === 'object' && schema.properties) {
     return `{ ${Object.entries(schema.properties)
-      .map(([k, v]: [string, any]) => `${k}: ${jsonSchemaTypeToTs(v)}`)
+      .map(([k, v]: [string, any]) => ``)
       .join('; ')} }`;
   }
killedBy: jsonSchemaTypeToTs returns object type for object schema with properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ foo: string; bar: number }"
Received: "{ ;  }"

[Killed] StringLiteral
src/utils/openapi-to-mcp.ts:45:13
   if (schema.type === 'object' && schema.properties) {
     return `{ ${Object.entries(schema.properties)
       .map(([k, v]: [string, any]) => `${k}: ${jsonSchemaTypeToTs(v)}`)
-      .join('; ')} }`;
+      .join("")} }`;
   }
   return 'any';
killedBy: jsonSchemaTypeToTs returns object type for object schema with properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ foo: string; bar: number }"
Received: "{ foo: stringbar: number }"

[Killed] BlockStatement
src/utils/openapi-to-mcp.ts:54:36
  * Extracts MCP tool definitions from OpenAPI spec.
  * Each tool includes name, inputSchema, outputSchema, description, and zod schemas.
  */
-function buildInputSchema(op: any) {
-  const inputSchema: { type: string; properties: Record<string, any>; required: string[] } = {
-    type: 'object',
-    properties: {},
-    required: []
-  };
-  if (Array.isArray(op.parameters)) {
-    for (const param of op.parameters) {
-      inputSchema.properties[param.name] = param.schema || { type: 'string' };
-      if (param.required) inputSchema.required.push(param.name);
-    }
-  }
-  if (op.requestBody && op.requestBody.content && op.requestBody.content['application/json']) {
-    const bodySchema = op.requestBody.content['application/json'].schema;
-    inputSchema.properties['body'] = bodySchema;
-    inputSchema.required.push('body');
-  }
-  return inputSchema;
-}
+function buildInputSchema(op: any) {}
 
 function buildOutputSchema(op: any) {
killedBy: extractMcpToolsFromOpenApi handles param.required falsy in extractMcpToolsFromOpenApi
statusReason: TypeError: Cannot read properties of undefined (reading 'required')

[Killed] ConditionalExpression
src/utils/openapi-to-mcp.ts:60:7
     properties: {},
     required: []
   };
-  if (Array.isArray(op.parameters)) {
+  if (false) {
     for (const param of op.parameters) {
       inputSchema.properties[param.name] = param.schema || { type: 'string' };
killedBy: extractMcpToolsFromOpenApi handles param.required falsy in extractMcpToolsFromOpenApi
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "bar"
Received path: []

Received value: {}

[Killed] BlockStatement
src/utils/openapi-to-mcp.ts:60:37
     properties: {},
     required: []
   };
-  if (Array.isArray(op.parameters)) {
-    for (const param of op.parameters) {
-      inputSchema.properties[param.name] = param.schema || { type: 'string' };
-      if (param.required) inputSchema.required.push(param.name);
-    }
-  }
+  if (Array.isArray(op.parameters)) {}
   if (op.requestBody && op.requestBody.content && op.requestBody.content['application/json']) {
     const bodySchema = op.requestBody.content['application/json'].schema;
killedBy: extractMcpToolsFromOpenApi handles param.required falsy in extractMcpToolsFromOpenApi
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "bar"
Received path: []

Received value: {}

[Killed] BlockStatement
src/utils/openapi-to-mcp.ts:61:40
     required: []
   };
   if (Array.isArray(op.parameters)) {
-    for (const param of op.parameters) {
-      inputSchema.properties[param.name] = param.schema || { type: 'string' };
-      if (param.required) inputSchema.required.push(param.name);
-    }
+    for (const param of op.parameters) {}
   }
   if (op.requestBody && op.requestBody.content && op.requestBody.content['application/json']) {
killedBy: extractMcpToolsFromOpenApi handles param.required falsy in extractMcpToolsFromOpenApi
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "bar"
Received path: []

Received value: {}

[Killed] LogicalOperator
src/utils/openapi-to-mcp.ts:62:44
   };
   if (Array.isArray(op.parameters)) {
     for (const param of op.parameters) {
-      inputSchema.properties[param.name] = param.schema || { type: 'string' };
+      inputSchema.properties[param.name] = param.schema && {
+  type: 'string'
+};
       if (param.required) inputSchema.required.push(param.name);
     }
killedBy: openapi-to-mcp param schema fallback should use { type: "string" } if param.schema is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"type": "string"}
Received: undefined

[Killed] ConditionalExpression
src/utils/openapi-to-mcp.ts:62:44
   };
   if (Array.isArray(op.parameters)) {
     for (const param of op.parameters) {
-      inputSchema.properties[param.name] = param.schema || { type: 'string' };
+      inputSchema.properties[param.name] = false;
       if (param.required) inputSchema.required.push(param.name);
     }
killedBy: openapi-to-mcp param schema fallback should use { type: "string" } if param.schema is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"type": "string"}
Received: false

[Killed] ConditionalExpression
src/utils/openapi-to-mcp.ts:63:11
   if (Array.isArray(op.parameters)) {
     for (const param of op.parameters) {
       inputSchema.properties[param.name] = param.schema || { type: 'string' };
-      if (param.required) inputSchema.required.push(param.name);
+      if (true) inputSchema.required.push(param.name);
     }
   }
killedBy: extractMcpToolsFromOpenApi handles param.required falsy in extractMcpToolsFromOpenApi
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "bar",

[Survived] ConditionalExpression
src/utils/openapi-to-mcp.ts:63:11
   if (Array.isArray(op.parameters)) {
     for (const param of op.parameters) {
       inputSchema.properties[param.name] = param.schema || { type: 'string' };
-      if (param.required) inputSchema.required.push(param.name);
+      if (false) inputSchema.required.push(param.name);
     }
   }

[Survived] ConditionalExpression
src/utils/openapi-to-mcp.ts:66:7
       if (param.required) inputSchema.required.push(param.name);
     }
   }
-  if (op.requestBody && op.requestBody.content && op.requestBody.content['application/json']) {
+  if (false) {
     const bodySchema = op.requestBody.content['application/json'].schema;
     inputSchema.properties['body'] = bodySchema;

[Survived] BlockStatement
src/utils/openapi-to-mcp.ts:66:95
       if (param.required) inputSchema.required.push(param.name);
     }
   }
-  if (op.requestBody && op.requestBody.content && op.requestBody.content['application/json']) {
-    const bodySchema = op.requestBody.content['application/json'].schema;
-    inputSchema.properties['body'] = bodySchema;
-    inputSchema.required.push('body');
-  }
+  if (op.requestBody && op.requestBody.content && op.requestBody.content['application/json']) {}
   return inputSchema;
 }

[Survived] StringLiteral
src/utils/openapi-to-mcp.ts:69:31
   if (op.requestBody && op.requestBody.content && op.requestBody.content['application/json']) {
     const bodySchema = op.requestBody.content['application/json'].schema;
     inputSchema.properties['body'] = bodySchema;
-    inputSchema.required.push('body');
+    inputSchema.required.push("");
   }
   return inputSchema;

[Survived] BlockStatement
src/utils/openapi-to-mcp.ts:74:37
   return inputSchema;
 }
 
-function buildOutputSchema(op: any) {
-  let outputSchema = {};
-  if (op.responses && (op.responses['200'] || op.responses['201'])) {
-    const resp = op.responses['200'] || op.responses['201'];
-    if (resp.content && resp.content['application/json']) {
-      outputSchema = resp.content['application/json'].schema;
-    }
-  }
-  return outputSchema;
-}
+function buildOutputSchema(op: any) {}
 
 export function extractMcpToolsFromOpenApi(openapi: any) {

[Survived] ConditionalExpression
src/utils/openapi-to-mcp.ts:76:24
 
 function buildOutputSchema(op: any) {
   let outputSchema = {};
-  if (op.responses && (op.responses['200'] || op.responses['201'])) {
+  if (op.responses && (true)) {
     const resp = op.responses['200'] || op.responses['201'];
     if (resp.content && resp.content['application/json']) {

[Survived] LogicalOperator
src/utils/openapi-to-mcp.ts:76:24
 
 function buildOutputSchema(op: any) {
   let outputSchema = {};
-  if (op.responses && (op.responses['200'] || op.responses['201'])) {
+  if (op.responses && (op.responses['200'] && op.responses['201'])) {
     const resp = op.responses['200'] || op.responses['201'];
     if (resp.content && resp.content['application/json']) {

[Survived] ConditionalExpression
src/utils/openapi-to-mcp.ts:77:18
 function buildOutputSchema(op: any) {
   let outputSchema = {};
   if (op.responses && (op.responses['200'] || op.responses['201'])) {
-    const resp = op.responses['200'] || op.responses['201'];
+    const resp = false;
     if (resp.content && resp.content['application/json']) {
       outputSchema = resp.content['application/json'].schema;

[Survived] ConditionalExpression
src/utils/openapi-to-mcp.ts:77:18
 function buildOutputSchema(op: any) {
   let outputSchema = {};
   if (op.responses && (op.responses['200'] || op.responses['201'])) {
-    const resp = op.responses['200'] || op.responses['201'];
+    const resp = true;
     if (resp.content && resp.content['application/json']) {
       outputSchema = resp.content['application/json'].schema;

[Survived] ConditionalExpression
src/utils/openapi-to-mcp.ts:78:9
   let outputSchema = {};
   if (op.responses && (op.responses['200'] || op.responses['201'])) {
     const resp = op.responses['200'] || op.responses['201'];
-    if (resp.content && resp.content['application/json']) {
+    if (false) {
       outputSchema = resp.content['application/json'].schema;
     }

[Survived] BlockStatement
src/utils/openapi-to-mcp.ts:78:59
   let outputSchema = {};
   if (op.responses && (op.responses['200'] || op.responses['201'])) {
     const resp = op.responses['200'] || op.responses['201'];
-    if (resp.content && resp.content['application/json']) {
-      outputSchema = resp.content['application/json'].schema;
-    }
+    if (resp.content && resp.content['application/json']) {}
   }
   return outputSchema;
