[Killed] BlockStatement
src/utils/openapi-to-mcp.ts:87:71
 
 export function extractMcpToolsFromOpenApi(openapi: any) {
   const tools = [];
-  for (const [pathKey, pathItemRaw] of Object.entries(openapi.paths)) {
-    const pathItem = pathItemRaw as Record<string, any>;
-    for (const method of Object.keys(pathItem)) {
-      const op = pathItem[method];
-      const name = op.operationId || `${method}_${pathKey.replace(/[/{}/]/g, '_')}`;
-      const description = op.description || op.summary || '';
-      const inputSchema = buildInputSchema(op);
-      const outputSchema = buildOutputSchema(op);
-      const inputType = jsonSchemaToTypeScriptType(inputSchema, `${name}Input`);
-      const outputType = jsonSchemaToTypeScriptType(outputSchema, `${name}Output`);
-      const inputZod = jsonSchemaToZod(inputSchema);
-      const outputZod = jsonSchemaToZod(outputSchema);
-      tools.push({ name, description, inputSchema, outputSchema, inputType, outputType, inputZod, outputZod });
-    }
-  }
+  for (const [pathKey, pathItemRaw] of Object.entries(openapi.paths)) {}
   return tools;
 }
killedBy: OpenAPI to MCP Tool Mapping should extract tools from OpenAPI spec
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/utils/openapi-to-mcp.ts:89:49
   const tools = [];
   for (const [pathKey, pathItemRaw] of Object.entries(openapi.paths)) {
     const pathItem = pathItemRaw as Record<string, any>;
-    for (const method of Object.keys(pathItem)) {
-      const op = pathItem[method];
-      const name = op.operationId || `${method}_${pathKey.replace(/[/{}/]/g, '_')}`;
-      const description = op.description || op.summary || '';
-      const inputSchema = buildInputSchema(op);
-      const outputSchema = buildOutputSchema(op);
-      const inputType = jsonSchemaToTypeScriptType(inputSchema, `${name}Input`);
-      const outputType = jsonSchemaToTypeScriptType(outputSchema, `${name}Output`);
-      const inputZod = jsonSchemaToZod(inputSchema);
-      const outputZod = jsonSchemaToZod(outputSchema);
-      tools.push({ name, description, inputSchema, outputSchema, inputType, outputType, inputZod, outputZod });
-    }
+    for (const method of Object.keys(pathItem)) {}
   }
   return tools;
killedBy: OpenAPI to MCP Tool Mapping should extract tools from OpenAPI spec
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] LogicalOperator
src/utils/openapi-to-mcp.ts:91:20
     const pathItem = pathItemRaw as Record<string, any>;
     for (const method of Object.keys(pathItem)) {
       const op = pathItem[method];
-      const name = op.operationId || `${method}_${pathKey.replace(/[/{}/]/g, '_')}`;
+      const name = op.operationId && `${method}_${pathKey.replace(/[/{}/]/g, '_')}`;
       const description = op.description || op.summary || '';
       const inputSchema = buildInputSchema(op);
killedBy: mcpHandlers toolsCallHandler returns 500 if no validation schema
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] ConditionalExpression
src/utils/openapi-to-mcp.ts:91:20
     const pathItem = pathItemRaw as Record<string, any>;
     for (const method of Object.keys(pathItem)) {
       const op = pathItem[method];
-      const name = op.operationId || `${method}_${pathKey.replace(/[/{}/]/g, '_')}`;
+      const name = false;
       const description = op.description || op.summary || '';
       const inputSchema = buildInputSchema(op);

[Killed] ConditionalExpression
src/utils/openapi-to-mcp.ts:92:27
     for (const method of Object.keys(pathItem)) {
       const op = pathItem[method];
       const name = op.operationId || `${method}_${pathKey.replace(/[/{}/]/g, '_')}`;
-      const description = op.description || op.summary || '';
+      const description = true;
       const inputSchema = buildInputSchema(op);
       const outputSchema = buildOutputSchema(op);
killedBy: extractMcpToolsFromOpenApi handles missing description and summary in extractMcpToolsFromOpenApi
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: true

[Killed] ConditionalExpression
src/utils/openapi-to-mcp.ts:92:27
     for (const method of Object.keys(pathItem)) {
       const op = pathItem[method];
       const name = op.operationId || `${method}_${pathKey.replace(/[/{}/]/g, '_')}`;
-      const description = op.description || op.summary || '';
+      const description = false;
       const inputSchema = buildInputSchema(op);
       const outputSchema = buildOutputSchema(op);
killedBy: extractMcpToolsFromOpenApi handles missing description and summary in extractMcpToolsFromOpenApi
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: false

[Killed] StringLiteral
src/utils/openapi-to-mcp.ts:96:67
       const inputSchema = buildInputSchema(op);
       const outputSchema = buildOutputSchema(op);
       const inputType = jsonSchemaToTypeScriptType(inputSchema, `${name}Input`);
-      const outputType = jsonSchemaToTypeScriptType(outputSchema, `${name}Output`);
+      const outputType = jsonSchemaToTypeScriptType(outputSchema, ``);
       const inputZod = jsonSchemaToZod(inputSchema);
       const outputZod = jsonSchemaToZod(outputSchema);
killedBy: index.ts (Express app) middleware and error handler coverage applies rate limiter when NODE_ENV is not test (functional)
statusReason: Error: read ECONNRESET
