[Killed] BlockStatement
src/utils/streamStateStore.ts:15:74
 
 const streamStore: Record<string, StreamState> = {};
 
-export function createStreamState(sessionId: string, state: StreamState) {
-  streamStore[sessionId] = state;
-}
+export function createStreamState(sessionId: string, state: StreamState) {}
 
 export function getStreamState(sessionId: string): StreamState | undefined {
killedBy: streamStateStore creates and retrieves stream state
statusReason: Error: expect(received).toMatchObject(expected)

Matcher error: received value must be a non-null object

Received has value: undefined

[Killed] BlockStatement
src/utils/streamStateStore.ts:19:76
   streamStore[sessionId] = state;
 }
 
-export function getStreamState(sessionId: string): StreamState | undefined {
-  return streamStore[sessionId];
-}
+export function getStreamState(sessionId: string): StreamState | undefined {}
 
 export function updateStreamState(sessionId: string, update: Partial<StreamState>) {
killedBy: streamStateStore creates and retrieves stream state
statusReason: Error: expect(received).toMatchObject(expected)

Matcher error: received value must be a non-null object

Received has value: undefined

[Killed] BlockStatement
src/utils/streamStateStore.ts:23:84
   return streamStore[sessionId];
 }
 
-export function updateStreamState(sessionId: string, update: Partial<StreamState>) {
-  if (streamStore[sessionId]) {
-    Object.assign(streamStore[sessionId], update);
-  }
-}
+export function updateStreamState(sessionId: string, update: Partial<StreamState>) {}
 
 export function deleteStreamState(sessionId: string) {
killedBy: streamStateStore updates stream state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[Killed] ConditionalExpression
src/utils/streamStateStore.ts:24:7
 }
 
 export function updateStreamState(sessionId: string, update: Partial<StreamState>) {
-  if (streamStore[sessionId]) {
+  if (false) {
     Object.assign(streamStore[sessionId], update);
   }
killedBy: streamStateStore updates stream state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[Killed] BlockStatement
src/utils/streamStateStore.ts:24:31
 }
 
 export function updateStreamState(sessionId: string, update: Partial<StreamState>) {
-  if (streamStore[sessionId]) {
-    Object.assign(streamStore[sessionId], update);
-  }
+  if (streamStore[sessionId]) {}
 }
 
killedBy: streamStateStore updates stream state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[Killed] BlockStatement
src/utils/streamStateStore.ts:29:54
   }
 }
 
-export function deleteStreamState(sessionId: string) {
-  delete streamStore[sessionId];
-}
+export function deleteStreamState(sessionId: string) {}
 
killedBy: streamStateStore deletes stream state
statusReason: Error: expect(received).toBeUndefined()

Received: {"completed": false, "params": {"foo": "bar"}, "progress": 50, "resultChunks": [], "tool": "echo", "userId": "user1"}
